Repository: fdivrusa/Finova
Catalog: src/Finova.Core/Internals/ValidationMessages.*.resx
Languages: de, fr, nl

# VatTooShortForCountryCode
source: VAT number is too short to extract country code.
de: Umsatzsteuernummer ist zu kurz, um den Ländercode zu extrahieren.
fr: Le numéro de TVA est trop court pour extraire le code pays.
nl: BTW-nummer is te kort om de landcode te extraheren.

# InvalidCountryCodeExpected
source: Invalid country code. Expected {0}.
de: Ungültiger Ländercode. Erwartet {0}.
fr: Code pays invalide. Attendu {0}.
nl: Ongeldige landcode. Verwacht {0}.

# InvalidUkBankCodeFormat
source: UK Bank Code must be letters.
de: UK Bankleitzahl muss aus Buchstaben bestehen.
fr: Le code banque britannique doit être composé de lettres.
nl: Britse bankcode moet uit letters bestaan.

# InvalidUkSortCodeFormat
source: UK Sort Code/Account Number must be digits.
de: UK Sort Code/Kontonummer muss aus Ziffern bestehen.
fr: Le code guichet/numéro de compte britannique doit être composé de chiffres.
nl: Britse sorteercode/rekeningnummer moet uit cijfers bestaan.

# InvalidPvmLength
source: PVM must be 9 digits.
de: PVM muss 9 Ziffern haben.
fr: Le PVM doit comporter 9 chiffres.
nl: PVM moet 9 cijfers bevatten.

# InvalidUkraineBankCodeFormat
source: Bank Code (MFO) must be digits.
de: Bankleitzahl (MFO) muss aus Ziffern bestehen.
fr: Le code banque (MFO) doit être composé de chiffres.
nl: Bankcode (MFO) moet uit cijfers bestaan.

# InvalidUkraineAccountNumberFormat
source: Account Number must be digits.
de: Kontonummer muss aus Ziffern bestehen.
fr: Le numéro de compte doit être composé de chiffres.
nl: Rekeningnummer moet uit cijfers bestaan.

# InvalidSwitzerlandClearingNumberFormat
source: Switzerland Clearing Number must be digits.
de: Schweizer Clearingnummer muss aus Ziffern bestehen.
fr: Le numéro de compensation suisse doit être composé de chiffres.
nl: Zwitsers clearingnummer moet uit cijfers bestaan.

# InvalidSwitzerlandAccountNumberFormat
source: Switzerland Account Number must be alphanumeric.
de: Schweizer Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte suisse doit être alphanumérique.
nl: Zwitsers rekeningnummer moet alfanumeriek zijn.

# InvalidIbanDigitsOnly
source: {0} IBAN must contain only digits after the country code.
de: {0} IBAN darf nach dem Ländercode nur Ziffern enthalten.
fr: L'IBAN {0} ne doit contenir que des chiffres après le code pays.
nl: {0} IBAN mag alleen cijfers bevatten na de landcode.

source: Invalid Slovak Prefix checksum.
de: Ungültige slowakische Präfix-Prüfsumme.
fr: Somme de contrôle du préfixe slovaque invalide.
nl: Ongeldige Slowaakse prefix checksum.

source: Invalid Slovak Account Number checksum.
de: Ungültige slowakische Kontonummer-Prüfsumme.
fr: Somme de contrôle du numéro de compte slovaque invalide.
nl: Ongeldige Slowaakse rekeningnummer checksum.

source: Invalid Spanish DC check.
de: Ungültige spanische DC-Prüfung.
fr: Vérification DC espagnole invalide.
nl: Ongeldige Spaanse DC-controle.

source: Invalid NIB Key.
de: Ungültiger NIB-Schlüssel.
fr: Clé NIB invalide.
nl: Ongeldige NIB-sleutel.

# InvalidIsoReferencePrefix
source: Reference must start with 'RF'.
de: Referenz muss mit 'RF' beginnen.
fr: La référence doit commencer par 'RF'.
nl: Referentie moet beginnen met 'RF'.

# InvalidIsoReferenceLength
source: Reference length is too short.
de: Referenzlänge ist zu kurz.
fr: La longueur de la référence est trop courte.
nl: Referentielengte is te kort.

# InvalidSwedishOcrLength
source: Swedish OCR reference must be between 2 and 25 digits.
de: Schwedische OCR-Referenz muss zwischen 2 und 25 Ziffern haben.
fr: La référence OCR suédoise doit comporter entre 2 et 25 chiffres.
nl: Zweedse OCR-referentie moet tussen 2 en 25 cijfers bevatten.

source: Invalid length digit.
de: Ungültige Längenziffer.
fr: Chiffre de longueur invalide.
nl: Ongeldig lengtecijfer.

# InvalidFinnishReferenceLength
source: Finnish reference must be between 4 and 20 digits.
de: Finnische Referenz muss zwischen 4 und 20 Ziffern haben.
fr: La référence finlandaise doit comporter entre 4 et 20 chiffres.
nl: Finse referentie moet tussen 4 en 20 cijfers bevatten.

source: Invalid Swiss QR-Reference.
de: Ungültige Schweizer QR-Referenz.
fr: Référence QR suisse invalide.
nl: Ongeldige Zwitserse QR-referentie.

source: Invalid Swedish OCR reference.
de: Ungültige schwedische OCR-Referenz.
fr: Référence OCR suédoise invalide.
nl: Ongeldige Zweedse OCR-referentie.

# InvalidCrnLength
source: CRN must be 8 characters.
de: CRN muss 8 Zeichen haben.
fr: Le CRN doit comporter 8 caractères.
nl: CRN moet 8 tekens bevatten.

source: Invalid CRN format.
de: Ungültiges CRN-Format.
fr: Format CRN invalide.
nl: Ongeldig CRN-formaat.

source: Invalid CIF format.
de: Ungültiges CIF-Format.
fr: Format CIF invalide.
nl: Ongeldig CIF-formaat.

source: Invalid CIF check letter.
de: Ungültiger CIF-Prüfbuchstabe.
fr: Lettre de contrôle CIF invalide.
nl: Ongeldige CIF-controleletter.

source: Invalid CIF check digit.
de: Ungültige CIF-Prüfziffer.
fr: Chiffre de contrôle CIF invalide.
nl: Ongeldig CIF-controlecijfer.

source: Invalid CIF check character.
de: Ungültiges CIF-Prüfzeichen.
fr: Caractère de contrôle CIF invalide.
nl: Ongeldig CIF-controleteken.

source: Invalid IBAN.
de: Ungültige IBAN.
fr: IBAN invalide.
nl: Ongeldige IBAN.

# InvalidAbnLength
source: ABN must be 11 digits.
de: ABN muss 11 Ziffern haben.
fr: L'ABN doit comporter 11 chiffres.
nl: ABN moet 11 cijfers bevatten.

# InvalidAbnFormat
source: ABN must contain only digits.
de: ABN darf nur Ziffern enthalten.
fr: L'ABN ne doit contenir que des chiffres.
nl: ABN mag alleen cijfers bevatten.

source: Invalid ABN checksum.
de: Ungültige ABN-Prüfsumme.
fr: Somme de contrôle ABN invalide.
nl: Ongeldige ABN-checksum.

# InvalidTfnLength
source: TFN must be 8 or 9 digits.
de: TFN muss 8 oder 9 Ziffern haben.
fr: Le TFN doit comporter 8 ou 9 chiffres.
nl: TFN moet 8 of 9 cijfers bevatten.

# InvalidTfnFormat
source: TFN must contain only digits.
de: TFN darf nur Ziffern enthalten.
fr: Le TFN ne doit contenir que des chiffres.
nl: TFN mag alleen cijfers bevatten.

source: Invalid TFN checksum.
de: Ungültige TFN-Prüfsumme.
fr: Somme de contrôle TFN invalide.
nl: Ongeldige TFN-checksum.

# InvalidVaticanVatFormat
source: Invalid Vatican City VAT format.
de: Ungültiges Vatikanstadt-Umsatzsteuerformat.
fr: Format de TVA du Vatican invalide.
nl: Ongeldig Vaticaanstad BTW-formaat.

# InvalidVaticanVatChecksum
source: Invalid Vatican City VAT checksum.
de: Ungültige Vatikanstadt-Umsatzsteuerprüfsumme.
fr: Somme de contrôle de TVA du Vatican invalide.
nl: Ongeldige Vaticaanstad BTW-checksum.

# InvalidBnLength
source: BN must be 9 digits.
de: BN muss 9 Ziffern haben.
fr: Le BN doit comporter 9 chiffres.
nl: BN moet 9 cijfers bevatten.

# InvalidBnFormat
source: BN must contain only digits.
de: BN darf nur Ziffern enthalten.
fr: Le BN ne doit contenir que des chiffres.
nl: BN mag alleen cijfers bevatten.

source: Invalid BN checksum.
de: Ungültige BN-Prüfsumme.
fr: Somme de contrôle BN invalide.
nl: Ongeldige BN-checksum.

# InvalidEinLength
source: EIN must be 9 digits.
de: EIN muss 9 Ziffern haben.
fr: L'EIN doit comporter 9 chiffres.
nl: EIN moet 9 cijfers bevatten.

# InvalidEinFormat
source: EIN must contain only digits.
de: EIN darf nur Ziffern enthalten.
fr: L'EIN ne doit contenir que des chiffres.
nl: EIN mag alleen cijfers bevatten.

# InvalidSinLength
source: SIN must be 9 digits.
de: SIN muss 9 Ziffern haben.
fr: Le SIN doit comporter 9 chiffres.
nl: SIN moet 9 cijfers bevatten.

# InvalidSinFormat
source: SIN must contain only digits.
de: SIN darf nur Ziffern enthalten.
fr: Le SIN ne doit contenir que des chiffres.
nl: SIN mag alleen cijfers bevatten.

source: Invalid SIN checksum.
de: Ungültige SIN-Prüfsumme.
fr: Somme de contrôle SIN invalide.
nl: Ongeldige SIN-checksum.

source: Invalid Slovenia VAT format.
de: Ungültiges slowenisches Umsatzsteuerformat.
fr: Format de TVA slovène invalide.
nl: Ongeldig Sloveens BTW-formaat.

source: Invalid Slovenia VAT checksum.
de: Ungültige slowenische Umsatzsteuerprüfsumme.
fr: Somme de contrôle de TVA slovène invalide.
nl: Ongeldige Sloveense BTW-checksum.

# InvalidSloveniaVatChecksumForbidden
source: Invalid Slovenia VAT checksum (forbidden remainder).
de: Ungültige slowenische Umsatzsteuerprüfsumme (verbotener Rest).
fr: Somme de contrôle de TVA slovène invalide (reste interdit).
nl: Ongeldige Sloveense BTW-checksum (verboden rest).

source: Invalid Slovenian SI12 reference.
de: Ungültige slowenische SI12-Referenz.
fr: Référence SI12 slovène invalide.
nl: Ongeldige Sloveense SI12-referentie.

# InvalidIbanLengthExpected
source: Invalid length. Expected {0}, got {1}.
de: Ungültige Länge. Erwartet {0}, erhalten {1}.
fr: Longueur invalide. Attendu {0}, obtenu {1}.
nl: Ongeldige lengte. Verwacht {0}, gekregen {1}.

source: Invalid Poland NIP format.
de: Ungültiges polnisches NIP-Format.
fr: Format NIP polonais invalide.
nl: Ongeldig Pools NIP-formaat.

# InvalidPolandNipChecksumForbidden
source: Invalid Poland NIP checksum (forbidden remainder).
de: Ungültige polnische NIP-Prüfsumme (verbotener Rest).
fr: Somme de contrôle NIP polonais invalide (reste interdit).
nl: Ongeldige Poolse NIP-checksum (verboden rest).

source: Invalid Poland NIP checksum.
de: Ungültige polnische NIP-Prüfsumme.
fr: Somme de contrôle NIP polonais invalide.
nl: Ongeldige Poolse NIP-checksum.

source: Invalid Ukraine EDRPOU format.
de: Ungültiges ukrainisches EDRPOU-Format.
fr: Format EDRPOU ukrainien invalide.
nl: Ongeldig Oekraïens EDRPOU-formaat.

source: Invalid Ukraine EDRPOU checksum.
de: Ungültige ukrainische EDRPOU-Prüfsumme.
fr: Somme de contrôle EDRPOU ukrainien invalide.
nl: Ongeldige Oekraïense EDRPOU-checksum.

source: Invalid Turkey VKN format.
de: Ungültiges türkisches VKN-Format.
fr: Format VKN turc invalide.
nl: Ongeldig Turks VKN-formaat.

source: Invalid Turkey VKN checksum.
de: Ungültige türkische VKN-Prüfsumme.
fr: Somme de contrôle VKN turc invalide.
nl: Ongeldige Turkse VKN-checksum.

source: Invalid Sweden VAT format.
de: Ungültiges schwedisches Umsatzsteuerformat.
fr: Format de TVA suédois invalide.
nl: Ongeldig Zweeds BTW-formaat.

source: Invalid Sweden VAT checksum.
de: Ungültige schwedische Umsatzsteuerprüfsumme.
fr: Somme de contrôle de TVA suédois invalide.
nl: Ongeldige Zweedse BTW-checksum.

source: Invalid North Macedonia VAT format.
de: Ungültiges nordmazedonisches Umsatzsteuerformat.
fr: Format de TVA de Macédoine du Nord invalide.
nl: Ongeldig Noord-Macedonisch BTW-formaat.

# InvalidNorthMacedoniaVatChecksumForbidden
source: Invalid North Macedonia VAT checksum (Check digit 10).
de: Ungültige nordmazedonische Umsatzsteuerprüfsumme (Prüfziffer 10).
fr: Somme de contrôle de TVA de Macédoine du Nord invalide (chiffre de contrôle 10).
nl: Ongeldige Noord-Macedonische BTW-checksum (controlecijfer 10).

source: Invalid North Macedonia VAT checksum.
de: Ungültige nordmazedonische Umsatzsteuerprüfsumme.
fr: Somme de contrôle de TVA de Macédoine du Nord invalide.
nl: Ongeldige Noord-Macedonische BTW-checksum.
