Repository: fdivrusa/Finova
Catalog: src/Finova.Core/Resources/ValidationMessages.*.resx
Languages: de, fr, nl

# NoTaxIdValidatorRegistered
source: No Tax ID validator registered for this country.
de: Kein Steuer-ID-Validator für dieses Land registriert.
fr: Aucun validateur d'identifiant fiscal enregistré.
nl: Geen BTW-validator geregistreerd voor dit land.

source: Unsupported country code.
de: Nicht unterstützter Ländercode.
fr: Code pays non pris en charge.
nl: Niet-ondersteunde landcode.

source: VAT too short for country code.
de: USt-Nummer zu kurz für Ländercode.
fr: Le numéro de TVA est trop court pour extraire le code pays.
nl: BTW te kort voor landcode.

# InvalidIsinLength
source: ISIN must be exactly 12 characters.
de: ISIN muss genau 12 Zeichen lang sein.
fr: L'ISIN doit contenir exactement 12 caractères.
nl: ISIN moet precies 12 tekens bevatten.

# InvalidIsinFormat
source: ISIN must start with 2 letters, followed by 9 alphanumeric characters and 1 check digit.
de: ISIN muss mit 2 Buchstaben beginnen, gefolgt von 9 alphanumerischen Zeichen und 1 Prüfziffer.
fr: L'ISIN doit commencer par 2 lettres, suivies de 9 caractères alphanumériques et 1 chiffre de contrôle.
nl: ISIN moet beginnen met 2 letters, gevolgd door 9 alfanumerieke tekens en 1 controlecijfer.

source: Invalid ISIN checksum.
de: Ungültige ISIN-Prüfsumme.
fr: Somme de contrôle ISIN invalide.
nl: Ongeldige ISIN-controlesom.

# InvalidCusipLength
source: CUSIP must be exactly 9 characters.
de: CUSIP muss genau 9 Zeichen lang sein.
fr: Le CUSIP doit contenir exactement 9 caractères.
nl: CUSIP moet precies 9 tekens bevatten.

# InvalidCusipFormat
source: CUSIP must contain 8 alphanumeric characters followed by 1 check digit.
de: CUSIP muss 8 alphanumerische Zeichen gefolgt von 1 Prüfziffer enthalten.
fr: Le CUSIP doit contenir 8 caractères alphanumériques suivis d'1 chiffre de contrôle.
nl: CUSIP moet 8 alfanumerieke tekens bevatten gevolgd door 1 controlecijfer.

source: Invalid CUSIP checksum.
de: Ungültige CUSIP-Prüfsumme.
fr: Somme de contrôle CUSIP invalide.
nl: Ongeldige CUSIP-controlesom.

# InvalidSedolLength
source: SEDOL must be exactly 7 characters.
de: SEDOL muss genau 7 Zeichen lang sein.
fr: Le SEDOL doit contenir exactement 7 caractères.
nl: SEDOL moet precies 7 tekens bevatten.

# InvalidSedolFormat
source: SEDOL contains invalid characters. Vowels (A, E, I, O, U) are not allowed.
de: SEDOL enthält ungültige Zeichen. Vokale (A, E, I, O, U) sind nicht erlaubt.
fr: Le SEDOL contient des caractères invalides. Les voyelles (A, E, I, O, U) ne sont pas autorisées.
nl: SEDOL bevat ongeldige tekens. Klinkers (A, E, I, O, U) zijn niet toegestaan.

source: Invalid SEDOL checksum.
de: Ungültige SEDOL-Prüfsumme.
fr: Somme de contrôle SEDOL invalide.
nl: Ongeldige SEDOL-controlesom.

# InvalidCurrencyLength
source: Currency code must be exactly 3 characters.
de: Währungscode muss genau 3 Zeichen lang sein.
fr: Le code devise doit contenir exactement 3 caractères.
nl: Valutacode moet precies 3 tekens bevatten.

# InvalidCurrencyCode
source: Unknown currency code.
de: Unbekannter Währungscode.
fr: Code devise inconnu.
nl: Onbekende valutacode.
