Repository: fdivrusa/Finova
Catalog: src/Finova.Core/Resources/ValidationMessages.*.resx
Languages: de, fr, nl

source: Enterprise number cannot be empty.
de: Unternehmensnummer darf nicht leer sein.
fr: Enterprise number ne peut pas être vide.
nl: Ondernemingsnummer mag niet leeg zijn.

source: PIB must be 8 digits.
de: PIB muss 8 Ziffern lang sein.
fr: Le PIB doit comporter 8 chiffres.
nl: PIB moet 8 cijfers bevatten.

source: Invalid checksum (Remainder 1).
de: Ungültige Prüfsumme (Rest 1).
fr: somme de contrôle (Remainder 1).
nl: Ongeldige controlesom (Rest 1).

source: Invalid Netherlands VAT format.
de: Ungültiges Niederlande USt-Format.
fr: Format de TVA néerlandais invalide.
nl: Ongeldig Nederland BTW-formaat.

# InvalidNetherlandsVatChecksumMod97OrElfproef
source: Invalid checksum (Mod 97 or Elfproef).
de: Ungültige Prüfsumme (Mod 97 oder Elfproef).
fr: somme de contrôle (Mod 97 or Elfproef).
nl: Ongeldige controlesom (Mod 97 of Elfproef).

# InvalidNetherlandsCountryCode
source: Invalid country code. Expected NL.
de: Ungültiger Ländercode. Erwartet NL.
fr: Code pays invalide. Attendu NL.
nl: Ongeldige landcode. Verwacht NL.

source: Netherlands Bank Code must be letters.
de: Niederlande Bankleitzahl muss aus Buchstaben bestehen.
fr: Le code banque des Pays-Bas doit être composé de lettres.
nl: Nederlandse bankcode moet uit letters bestaan.

source: Netherlands Account Number must be digits.
de: Niederlande Kontonummer muss aus Ziffern bestehen.
fr: Le numéro de compte des Pays-Bas doit être composé de chiffres.
nl: Nederlands rekeningnummer moet uit cijfers bestaan.

source: Invalid Elfproef check.
de: Ungültige Elfproef-Prüfung.
fr: Vérification Elfproef invalide.
nl: Ongeldige Elfproef-controle.

source: Invalid North Macedonia EDB format.
de: Ungültiges Nordmazedonien EDB-Format.
fr: Format EDB de Macédoine du Nord invalide.
nl: Ongeldig Noord-Macedonië EDB-formaat.

source: Invalid North Macedonia EDB checksum (forbidden remainder).
de: Ungültige Nordmazedonien EDB-Prüfsumme (verbotener Rest).
fr: North Macedonia EDB somme de contrôle (forbidden remainder).
nl: Ongeldige Noord-Macedonië EDB-controlesom (verboden rest).

source: Invalid North Macedonia EDB checksum.
de: Ungültige Nordmazedonien EDB-Prüfsumme.
fr: North Macedonia EDB somme de contrôle.
nl: Ongeldige Noord-Macedonië EDB-controlesom.

source: ID Card cannot be empty.
de: Personalausweis darf nicht leer sein.
fr: ID Card ne peut pas être vide.
nl: ID-kaart mag niet leeg zijn.

source: ID Card must be 18 characters.
de: Personalausweis muss 18 Zeichen lang sein.
fr: La carte d'identité doit comporter 18 caractères.
nl: ID-kaart moet 18 tekens bevatten.

source: First 17 characters must be digits.
de: Die ersten 17 Zeichen müssen Ziffern sein.
fr: Les 17 premiers caractères doivent être des chiffres.
nl: Eerste 17 tekens moeten cijfers zijn.

# LastCharacterMustBeDigitOrX
source: Last character must be a digit or 'X'.
de: Das letzte Zeichen muss eine Ziffer oder 'X' sein.
fr: Le dernier caractère doit être un chiffre ou 'X'.
nl: Laatste teken moet een cijfer of 'X' zijn.

source: Invalid ID Card checksum.
de: Ungültige Personalausweis-Prüfsumme.
fr: ID Card somme de contrôle.
nl: Ongeldige ID-kaart-controlesom.

source: Invalid Luxembourg VAT format.
de: Ungültiges Luxemburg USt-Format.
fr: Format de TVA luxembourgeois invalide.
nl: Ongeldig Luxemburg BTW-formaat.

source: Invalid Luxembourg VAT checksum.
de: Ungültige Luxemburg USt-Prüfsumme.
fr: Luxembourg VAT somme de contrôle.
nl: Ongeldige Luxemburg BTW-controlesom.

# InvalidKosovoCountryCode
source: Invalid country code. Expected XK.
de: Ungültiger Ländercode. Erwartet XK.
fr: Code pays invalide. Attendu XK.
nl: Ongeldige landcode. Verwacht XK.

# KosovoIbanMustContainOnlyDigits
source: Kosovo IBAN must contain only digits after the country code.
de: Kosovo IBAN darf nach dem Ländercode nur Ziffern enthalten.
fr: L'IBAN du Kosovo ne doit contenir que des chiffres après le code pays.
nl: Kosovo IBAN mag na de landcode alleen cijfers bevatten.

source: Invalid Moldova VAT format.
de: Ungültiges Moldawien USt-Format.
fr: Format de TVA moldave invalide.
nl: Ongeldig Moldavië BTW-formaat.

source: IDNO must be 13 digits.
de: IDNO muss 13 Ziffern lang sein.
fr: L'IDNO doit comporter 13 chiffres.
nl: IDNO moet 13 cijfers bevatten.

# InvalidMoldovaCountryCode
source: Invalid country code. Expected MD.
de: Ungültiger Ländercode. Erwartet MD.
fr: Code pays invalide. Attendu MD.
nl: Ongeldige landcode. Verwacht MD.

source: Bank code must be alphanumeric.
de: Bankleitzahl muss alphanumerisch sein.
fr: Le code banque doit être alphanumérique.
nl: Bankcode moet alfanumeriek zijn.

source: Invalid Greece VAT format.
de: Ungültiges Griechenland USt-Format.
fr: Format de TVA grec invalide.
nl: Ongeldig Griekenland BTW-formaat.

source: Invalid Greece VAT checksum.
de: Ungültige Griechenland USt-Prüfsumme.
fr: Greece VAT somme de contrôle.
nl: Ongeldige Griekenland BTW-controlesom.

# InvalidGreenlandCountryCode
source: Invalid country code. Expected GL.
de: Ungültiger Ländercode. Erwartet GL.
fr: Code pays invalide. Attendu GL.
nl: Ongeldige landcode. Verwacht GL.

# GreenlandIbanMustContainOnlyDigits
source: Greenland IBAN must contain only digits after the country code.
de: Grönland IBAN darf nach dem Ländercode nur Ziffern enthalten.
fr: L'IBAN du Groenland ne doit contenir que des chiffres après le code pays.
nl: Groenland IBAN mag na de landcode alleen cijfers bevatten.

source: CVR number must be 8 digits.
de: CVR-Nummer muss 8 Ziffern lang sein.
fr: Le numéro CVR doit comporter 8 chiffres.
nl: CVR-nummer moet 8 cijfers bevatten.

# InvalidGreeceCountryCode
source: Invalid country code. Expected GR.
de: Ungültiger Ländercode. Erwartet GR.
fr: Code pays invalide. Attendu GR.
nl: Ongeldige landcode. Verwacht GR.

source: Greece Bank/Branch code must be digits.
de: Griechenland Bank/Filiale-Code muss aus Ziffern bestehen.
fr: Le code banque/agence de Grèce doit être composé de chiffres.
nl: Griekenland Bank/Filiaalcode moet uit cijfers bestaan.

source: Greece Account Number must be alphanumeric.
de: Griechenland Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte de Grèce doit être alphanumérique.
nl: Griekenland rekeningnummer moet alfanumeriek zijn.

source: AFM must be 9 digits.
de: AFM muss 9 Ziffern lang sein.
fr: L'AFM doit comporter 9 chiffres.
nl: AFM moet 9 cijfers bevatten.

source: Invalid Malta VAT format.
de: Ungültiges Malta USt-Format.
fr: Format de TVA maltais invalide.
nl: Ongeldig Malta BTW-formaat.

source: Invalid Malta VAT checksum.
de: Ungültige Malta USt-Prüfsumme.
fr: Malta VAT somme de contrôle.
nl: Ongeldige Malta BTW-controlesom.

source: Invalid Croatia VAT format.
de: Ungültiges Kroatien USt-Format.
fr: Format de TVA croate invalide.
nl: Ongeldig Kroatië BTW-formaat.

source: Invalid Croatia VAT checksum.
de: Ungültige Kroatien USt-Prüfsumme.
fr: Croatia VAT somme de contrôle.
nl: Ongeldige Kroatië BTW-controlesom.

# InvalidFranceCountryCode
source: Invalid country code. Expected FR.
de: Ungültiger Ländercode. Erwartet FR.
fr: Code pays invalide. Attendu FR.
nl: Ongeldige landcode. Verwacht FR.

source: France Bank/Branch code must be digits.
de: Frankreich Bank/Filiale-Code muss aus Ziffern bestehen.
fr: Le code banque/agence de France doit être composé de chiffres.
nl: Frankrijk Bank/Filiaalcode moet uit cijfers bestaan.

source: France RIB Key must be digits.
de: Frankreich RIB-Schlüssel muss aus Ziffern bestehen.
fr: La clé RIB de France doit être composée de chiffres.
nl: Frankrijk RIB-sleutel moet uit cijfers bestaan.

source: Invalid RIB Key.
de: Ungültiger RIB-Schlüssel.
fr: Clé RIB invalide.
nl: Ongeldige RIB-sleutel.

# InvalidFranceVatFormatPrefixOrDigits
source: Invalid format. Expected FR prefix or 11 digits.
de: Ungültiges Format. Erwartet FR-Präfix oder 11 Ziffern.
fr: Format invalide. Attendu préfixe FR ou 11 chiffres.
nl: Ongeldig formaat. Verwacht FR-prefix of 11 cijfers.

# FranceVatDigitsAfterPrefix
source: VAT number must contain only digits after prefix.
de: USt-Nummer darf nach dem Präfix nur Ziffern enthalten.
fr: Le numéro de TVA ne doit contenir que des chiffres après le préfixe.
nl: BTW-nummer mag na de prefix alleen cijfers bevatten.

source: Invalid numeric format.
de: Ungültiges numerisches Format.
fr: Format numérique invalide.
nl: Ongeldig numeriek formaat.

source: Invalid SIREN format.
de: Ungültiges SIREN-Format.
fr: Format SIREN invalide.
nl: Ongeldig SIREN-formaat.

source: Invalid checksum (Key).
de: Ungültige Prüfsumme (Schlüssel).
fr: somme de contrôle (Key).
nl: Ongeldige controlesom (Sleutel).

source: Invalid checksum (SIREN Luhn).
de: Ungültige Prüfsumme (SIREN Luhn).
fr: somme de contrôle (SIREN Luhn).
nl: Ongeldige controlesom (SIREN Luhn).

source: Invalid Gibraltar Company Number format.
de: Ungültiges Gibraltar Firmennummer-Format.
fr: Format de numéro de société de Gibraltar invalide.
nl: Ongeldig Gibraltar bedrijfsnummer-formaat.

# InvalidGibraltarCountryCode
source: Invalid country code. Expected GI.
de: Ungültiger Ländercode. Erwartet GI.
fr: Code pays invalide. Attendu GI.
nl: Ongeldige landcode. Verwacht GI.

source: Gibraltar Bank Code must be letters.
de: Gibraltar Bankleitzahl muss aus Buchstaben bestehen.
fr: Le code banque de Gibraltar doit être composé de lettres.
nl: Gibraltar bankcode moet uit letters bestaan.

source: Gibraltar Account Number must be alphanumeric.
de: Gibraltar Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte de Gibraltar doit être alphanumérique.
nl: Gibraltar rekeningnummer moet alfanumeriek zijn.

source: Invalid Germany VAT format.
de: Ungültiges Deutschland USt-Format.
fr: Format de TVA allemand invalide.
nl: Ongeldig Duitsland BTW-formaat.

source: Steuernummer cannot be empty.
de: Steuernummer darf nicht leer sein.
fr: Steuernummer ne peut pas être vide.
nl: Steuernummer mag niet leeg zijn.

# SteuernummerMustBe13Digits
source: Steuernummer must be 13 digits (Unified Federal Format).
de: Steuernummer muss 13 Ziffern lang sein (Einheitliches Bundesformat).
fr: Le Steuernummer doit comporter 13 chiffres (format fédéral unifié).
nl: Steuernummer moet 13 cijfers bevatten (Uniform Federaal Formaat).

# InvalidGermanyCountryCode
source: Invalid country code. Expected DE.
de: Ungültiger Ländercode. Erwartet DE.
fr: Code pays invalide. Attendu DE.
nl: Ongeldige landcode. Verwacht DE.

# GermanyIbanMustContainOnlyDigits
source: Germany IBAN must contain only digits after the country code.
de: Deutschland IBAN darf nach dem Ländercode nur Ziffern enthalten.
fr: L'IBAN allemand ne doit contenir que des chiffres après le code pays.
nl: Duitsland IBAN mag na de landcode alleen cijfers bevatten.

source: Invalid Ireland VAT format.
de: Ungültiges Irland USt-Format.
fr: Format de TVA irlandais invalide.
nl: Ongeldig Ierland BTW-formaat.

source: Invalid Ireland VAT checksum.
de: Ungültige Irland USt-Prüfsumme.
fr: Ireland VAT somme de contrôle.
nl: Ongeldige Ierland BTW-controlesom.

# InvalidIrelandCountryCode
source: Invalid country code. Expected IE.
de: Ungültiger Ländercode. Erwartet IE.
fr: Code pays invalide. Attendu IE.
nl: Ongeldige landcode. Verwacht IE.

source: Ireland Bank Code must be letters.
de: Irland Bankleitzahl muss aus Buchstaben bestehen.
fr: Le code banque d'Irlande doit être composé de lettres.
nl: Ierland bankcode moet uit letters bestaan.

source: Ireland Sort Code/Account Number must be digits.
de: Irland Sort Code/Kontonummer muss aus Ziffern bestehen.
fr: Le code guichet/numéro de compte d'Irlande doit être composé de chiffres.
nl: Ierland Sort Code/Rekeningnummer moet uit cijfers bestaan.

# InvalidMaltaCountryCode
source: Invalid country code. Expected MT.
de: Ungültiger Ländercode. Erwartet MT.
fr: Code pays invalide. Attendu MT.
nl: Ongeldige landcode. Verwacht MT.

source: Malta Bank BIC must be letters.
de: Malta Bank BIC muss aus Buchstaben bestehen.
fr: Le BIC bancaire de Malte doit être composé de lettres.
nl: Malta Bank BIC moet uit letters bestaan.

source: Malta Sort Code must be digits.
de: Malta Sort Code muss aus Ziffern bestehen.
fr: Le code guichet de Malte doit être composé de chiffres.
nl: Malta Sort Code moet uit cijfers bestaan.

source: Malta Account Number must be alphanumeric.
de: Malta Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte de Malte doit être alphanumérique.
nl: Malta rekeningnummer moet alfanumeriek zijn.

source: Invalid Denmark VAT format.
de: Ungültiges Dänemark USt-Format.
fr: Format de TVA danois invalide.
nl: Ongeldig Denemarken BTW-formaat.

source: Invalid Denmark VAT checksum.
de: Ungültige Dänemark USt-Prüfsumme.
fr: Denmark VAT somme de contrôle.
nl: Ongeldige Denemarken BTW-controlesom.

# InvalidDenmarkPaymentReference
source: Invalid Danish FIK/GIK reference.
de: Ungültige dänische FIK/GIK-Referenz.
fr: Référence FIK/GIK danoise invalide.
nl: Ongeldige Deense FIK/GIK-referentie.

# InvalidDenmarkCountryCode
source: Invalid country code. Expected DK.
de: Ungültiger Ländercode. Erwartet DK.
fr: Code pays invalide. Attendu DK.
nl: Ongeldige landcode. Verwacht DK.

# DenmarkIbanMustContainOnlyDigits
source: Denmark IBAN must contain only digits after the country code.
de: Dänemark IBAN darf nach dem Ländercode nur Ziffern enthalten.
fr: L'IBAN danois ne doit contenir que des chiffres après le code pays.
nl: Denemarken IBAN mag na de landcode alleen cijfers bevatten.

source: Invalid Georgia VAT format.
de: Ungültiges Georgien USt-Format.
fr: Format de TVA géorgien invalide.
nl: Ongeldig Georgië BTW-formaat.

# InvalidGeorgiaTaxIdLength
source: Tax ID must be 9 digits.
de: Steuernummer muss 9 Ziffern lang sein.
fr: Le numéro fiscal doit comporter 9 chiffres.
nl: Belasting-ID moet 9 cijfers bevatten.

# InvalidGeorgiaTaxIdChecksumRemainder10
source: Invalid checksum (Remainder 10).
de: Ungültige Prüfsumme (Rest 10).
fr: somme de contrôle (Remainder 10).
nl: Ongeldige controlesom (Rest 10).

# InvalidDenmarkFikLength
source: FIK reference length invalid.
de: FIK-Referenzlänge ungültig.
fr: Longueur de référence FIK invalide.
nl: FIK-referentielengte ongeldig.

# InvalidDenmarkFikCheckDigit
source: Invalid FIK check digit (Luhn).
de: Ungültige FIK-Prüfziffer (Luhn).
fr: Chiffre de contrôle FIK Invalide (Luhn).
nl: Ongeldig FIK-controlecijfer (Luhn).

source: Handelsregisternummer cannot be empty.
de: Handelsregisternummer darf nicht leer sein.
fr: Handelsregisternummer ne peut pas être vide.
nl: Handelsregisternummer mag niet leeg zijn.

# InvalidGermanyHandelsregisternummerFormat
source: Invalid Handelsregisternummer format. Expected HRA or HRB followed by digits.
de: Ungültiges Handelsregisternummer-Format. Erwartet HRA oder HRB gefolgt von Ziffern.
fr: Format de Handelsregisternummer invalide. Attendu HRA ou HRB suivi de chiffres.
nl: Ongeldig Handelsregisternummer-formaat. Verwacht HRA of HRB gevolgd door cijfers.

# SiretCannotBeEmpty
source: SIRET number cannot be empty.
de: SIRET-Nummer darf nicht leer sein.
fr: SIRET number ne peut pas être vide.
nl: SIRET-nummer mag niet leeg zijn.

# InvalidSiretFormat
source: Invalid format. Expected 14 digits.
de: Ungültiges Format. Erwartet 14 Ziffern.
fr: Format invalide. Attendu 14 chiffres.
nl: Ongeldig formaat. Verwacht 14 cijfers.

# InvalidSiretChecksum
source: Invalid checksum (Luhn).
de: Ungültige Prüfsumme (Luhn).
fr: somme de contrôle (Luhn).
nl: Ongeldige controlesom (Luhn).

source: Invalid Finland VAT format.
de: Ungültiges Finnland USt-Format.
fr: Format de TVA finlandais invalide.
nl: Ongeldig Finland BTW-formaat.

# InvalidFinlandVatChecksumCheckDigit10
source: Invalid checksum (Check digit 10).
de: Ungültige Prüfsumme (Prüfziffer 10).
fr: somme de contrôle (Check digit 10).
nl: Ongeldige controlesom (Controlecijfer 10).

source: Invalid Finland VAT checksum.
de: Ungültige Finnland USt-Prüfsumme.
fr: Finland VAT somme de contrôle.
nl: Ongeldige Finland BTW-controlesom.

# IbanEmpty
source: IBAN cannot be empty.
de: IBAN darf nicht leer sein.
fr: IBAN ne peut pas être vide.
nl: IBAN mag niet leeg zijn.

# VatNumberEmpty
source: VAT number cannot be empty.
de: USt-Nummer darf nicht leer sein.
fr: VAT number ne peut pas être vide.
nl: BTW-nummer mag niet leeg zijn.

# FranceSirenEmpty
source: SIREN number cannot be empty.
de: SIREN-Nummer darf nicht leer sein.
fr: SIREN number ne peut pas être vide.
nl: SIREN-nummer mag niet leeg zijn.

# FranceSirenInvalidFormat
source: Invalid format. Expected 9 digits.
de: Ungültiges Format. Erwartet 9 Ziffern.
fr: Format invalide. Attendu 9 chiffres.
nl: Ongeldig formaat. Verwacht 9 cijfers.

# FranceSirenInvalidChecksum
source: Invalid checksum (Luhn).
de: Ungültige Prüfsumme (Luhn).
fr: somme de contrôle (Luhn).
nl: Ongeldige controlesom (Luhn).

# FaroeIslandsVatInvalidFormat
source: Invalid Faroe Islands VAT format.
de: Ungültiges Färöer-Inseln USt-Format.
fr: Format de TVA des îles Féroé invalide.
nl: Ongeldig Faeröer Eilanden BTW-formaat.

# FinlandBusinessIdEmpty
source: Enterprise number cannot be empty.
de: Unternehmensnummer darf nicht leer sein.
fr: Enterprise number ne peut pas être vide.
nl: Ondernemingsnummer mag niet leeg zijn.

# FinlandBusinessIdInvalidLength
source: Business ID must be 8 digits.
de: Business ID muss 8 Ziffern lang sein.
fr: L'identifiant d'entreprise doit comporter 8 chiffres.
nl: Bedrijfs-ID moet 8 cijfers bevatten.

# FinlandBusinessIdInvalidChecksumRemainder1
source: Invalid checksum (Remainder 1 is not allowed).
de: Ungültige Prüfsumme (Rest 1 ist nicht erlaubt).
fr: somme de contrôle (Remainder 1 is not allowed).
nl: Ongeldige controlesom (Rest 1 is niet toegestaan).

# CzechRepublicIbanInvalidPrefixChecksum
source: Invalid Czech Prefix checksum.
de: Ungültige Tschechische Präfix-Prüfsumme.
fr: Czech Prefix somme de contrôle.
nl: Ongeldige Tsjechische prefix-controlesom.

# CzechRepublicIbanInvalidAccountChecksum
source: Invalid Czech Account Number checksum.
de: Ungültige Tschechische Kontonummer-Prüfsumme.
fr: Czech Account Number somme de contrôle.
nl: Ongeldige Tsjechische rekeningnummer-controlesom.

# CzechRepublicIcoEmpty
source: IČO cannot be empty.
de: IČO darf nicht leer sein.
fr: IČO ne peut pas être vide.
nl: IČO mag niet leeg zijn.

# CzechRepublicIcoInvalidFormat
source: Invalid Czech Republic IČO format.
de: Ungültiges Tschechische Republik IČO-Format.
fr: Czech Republic IČO format.
nl: Ongeldig Tsjechië IČO-formaat.

# CzechRepublicIcoInvalidChecksum
source: Invalid Czech Republic IČO checksum.
de: Ungültige Tschechische Republik IČO-Prüfsumme.
fr: Czech Republic IČO somme de contrôle.
nl: Ongeldige Tsjechië IČO-controlesom.

# FinlandPaymentReferenceEmpty
source: Reference cannot be empty.
de: Referenz darf nicht leer sein.
fr: Reference ne peut pas être vide.
nl: Referentie mag niet leeg zijn.

# FinlandPaymentReferenceInvalidFormat
source: Invalid Finnish payment reference.
de: Ungültige finnische Zahlungsreferenz.
fr: Référence de paiement finlandaise invalide.
nl: Ongeldige Finse betalingsreferentie.

# CyprusTicEmpty
source: TIC cannot be empty.
de: TIC darf nicht leer sein.
fr: TIC ne peut pas être vide.
nl: TIC mag niet leeg zijn.

# CyprusTicInvalidFormat
source: Invalid Cyprus TIC format.
de: Ungültiges Zypern TIC-Format.
fr: Format TIC de Chypre invalide.
nl: Ongeldig Cyprus TIC-formaat.

# CyprusTicInvalidChecksum
source: Invalid Cyprus TIC checksum.
de: Ungültige Zypern TIC-Prüfsumme.
fr: Cyprus TIC somme de contrôle.
nl: Ongeldige Cyprus TIC-controlesom.

# CyprusIbanInvalidBankCode
source: Cyprus Bank Code must be digits.
de: Zypern Bankleitzahl muss aus Ziffern bestehen.
fr: Le code banque de Chypre doit être composé de chiffres.
nl: Cyprus bankcode moet uit cijfers bestaan.

# CyprusIbanInvalidBranchCode
source: Cyprus Branch Code must be digits.
de: Zypern Filialcode muss aus Ziffern bestehen.
fr: Le code agence de Chypre doit être composé de chiffres.
nl: Cyprus filiaalcode moet uit cijfers bestaan.

# CyprusIbanInvalidAccount
source: Cyprus Account Number must be alphanumeric.
de: Zypern Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte de Chypre doit être alphanumérique.
nl: Cyprus rekeningnummer moet alfanumeriek zijn.

# AzerbaijanVatInvalidFormat
source: Invalid Azerbaijan VAT format.
de: Ungültiges Aserbaidschan USt-Format.
fr: Format de TVA azerbaïdjanais invalide.
nl: Ongeldig Azerbeidzjan BTW-formaat.

# AzerbaijanIbanInvalidBankCode
source: Bank Code must be letters.
de: Bankleitzahl muss aus Buchstaben bestehen.
fr: Le code banque doit être composé de lettres.
nl: Bankcode moet uit letters bestaan.

# AzerbaijanIbanInvalidAccount
source: Account Number must be alphanumeric.
de: Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte doit être alphanumérique.
nl: Rekeningnummer moet alfanumeriek zijn.

# AustriaFirmenbuchEmpty
source: Firmenbuchnummer cannot be empty.
de: Firmenbuchnummer darf nicht leer sein.
fr: Firmenbuchnummer ne peut pas être vide.
nl: Firmenbuchnummer mag niet leeg zijn.

# AustriaFirmenbuchInvalidFormat
source: Invalid format. Expected 1-6 digits followed by a letter (optional FN prefix).
de: Ungültiges Format. Erwartet 1-6 Ziffern gefolgt von einem Buchstaben (optional FN-Präfix).
fr: Format invalide. Attendu 1-6 chiffres suivis d'une lettre (préfixe FN optionnel).
nl: Ongeldig formaat. Verwacht 1-6 cijfers gevolgd door een letter (optioneel FN-prefix).

# BulgariaIbanInvalidBankCode
source: Bulgaria Bank Code must be letters.
de: Bulgarien Bankleitzahl muss aus Buchstaben bestehen.
fr: Le code banque de Bulgarie doit être composé de lettres.
nl: Bulgarije bankcode moet uit letters bestaan.

# BulgariaUicEmpty
source: UIC cannot be empty.
de: UIC darf nicht leer sein.
fr: UIC ne peut pas être vide.
nl: UIC mag niet leeg zijn.

# BulgariaUicInvalidFormat
source: Invalid UIC format (must be 9 or 13 digits).
de: Ungültiges UIC-Format (muss 9 oder 13 Ziffern lang sein).
fr: Format UIC Invalide (doit comporter 9 ou 13 chiffres).
nl: Ongeldig UIC-formaat (moet 9 of 13 cijfers bevatten).

# BulgariaUicInvalidChecksum9
source: Invalid UIC checksum (9 digits).
de: Ungültige UIC-Prüfsumme (9 Ziffern).
fr: UIC somme de contrôle (9 digits).
nl: Ongeldige UIC-controlesom (9 cijfers).

# BulgariaUicInvalidChecksumBase
source: Invalid base UIC (first 9 digits).
de: Ungültige Basis-UIC (erste 9 Ziffern).
fr: UIC de base Invalide (9 premiers chiffres).
nl: Ongeldige basis-UIC (eerste 9 cijfers).

# BulgariaUicInvalidChecksum13
source: Invalid UIC checksum (13 digits).
de: Ungültige UIC-Prüfsumme (13 Ziffern).
fr: UIC somme de contrôle (13 digits).
nl: Ongeldige UIC-controlesom (13 cijfers).

# BelarusVatInvalidFormat
source: Invalid Belarus VAT format.
de: Ungültiges Weißrussland USt-Format.
fr: Format de TVA biélorusse invalide.
nl: Ongeldig Wit-Rusland BTW-formaat.

# BelarusVatInvalidChecksumMod11
source: Invalid checksum (Mod 11 result is 10).
de: Ungültige Prüfsumme (Mod 11 Ergebnis ist 10).
fr: somme de contrôle (Mod 11 result is 10).
nl: Ongeldige controlesom (Mod 11 resultaat is 10).

# AlbaniaIbanInvalidBankCode
source: Bank code must be numeric.
de: Bankleitzahl muss numerisch sein.
fr: Le code banque doit être numérique.
nl: Bankcode moet numeriek zijn.

# AlbaniaIbanInvalidBranchCode
source: Branch code must be numeric.
de: Filialcode muss numerisch sein.
fr: Le code guichet doit être numérique.
nl: Filiaalcode moet numeriek zijn.

# AlbaniaIbanInvalidControlChar
source: Control character must be alphanumeric.
de: Kontrollzeichen muss alphanumerisch sein.
fr: Le caractère de contrôle doit être alphanumérique.
nl: Controleteken moet alfanumeriek zijn.

# AlbaniaIbanInvalidAccount
source: Account number must be alphanumeric.
de: Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte doit être alphanumérique.
nl: Rekeningnummer moet alfanumeriek zijn.
