Repository: fdivrusa/Finova
Catalog: src/Finova.Core/Resources/ValidationMessages.*.resx
Languages: de, fr, nl

source: Input cannot be empty.
de: Eingabe darf nicht leer sein.
fr: La saisie ne peut pas être vide.
nl: Invoer mag niet leeg zijn.

source: Invalid format.
de: Ungültiges Format.
fr: Format invalide.
nl: Ongeldig formaat.

source: Invalid checksum.
de: Ungültige Prüfsumme.
fr: Somme de contrôle invalide.
nl: Ongeldige controlesom.

source: Invalid length.
de: Ungültige Länge.
fr: Longueur invalide.
nl: Ongeldige lengte.

source: Invalid country code.
de: Ungültiger Ländercode.
fr: Code pays invalide.
nl: Ongeldige landcode.

# UnsupportedCountry
source: Country not supported.
de: Land nicht unterstützt.
fr: Pays non pris en charge.
nl: Land niet ondersteund.

# UnsupportedCountryOrInvalidIban
source: Country not supported or IBAN is invalid.
fr: Pays non pris en charge ou IBAN invalide.
nl: Land niet ondersteund of IBAN is ongeldig.

# InvalidCheckDigit
source: Invalid check digits.
de: Ungültige Prüfziffern.
fr: Chiffres de contrôle invalides.
nl: Ongeldige controlecijfers.

# MustContainOnlyDigits
source: Input must contain only digits.
de: Eingabe darf nur Ziffern enthalten.
fr: La saisie ne doit contenir que des chiffres.
nl: Invoer mag alleen cijfers bevatten.

# MustContainOnlyDigitsAndLetters
source: Input must contain only digits and letters.
de: Eingabe darf nur Ziffern und Buchstaben enthalten.
fr: La saisie ne doit contenir que des chiffres et des lettres.
nl: Invoer mag alleen cijfers en letters bevatten.

# InvalidLengthExpectedX
source: Invalid length. Expected {0} characters.
de: Ungültige Länge. Erwartet {0} Zeichen.
fr: Longueur invalide. Attendu {0} caractères.
nl: Ongeldige lengte. Verwacht {0} tekens.

# InvalidLengthExpectedXGotY
source: Invalid length. Expected {0}, got {1}.
de: Ungültige Länge. Erwartet {0}, erhalten {1}.
fr: Longueur invalide. Attendu {0}, reçu {1}.
nl: Ongeldige lengte. Verwacht {0}, ontvangen {1}.

# InvalidVatFormat
source: Invalid {0} VAT format.
de: Ungültiges {0} USt-Format.
fr: Format de TVA {0} invalide.
nl: Ongeldig {0} BTW-formaat.

# InvalidVatChecksum
source: Invalid {0} VAT checksum.
de: Ungültige {0} USt-Prüfsumme.
fr: Somme de contrôle de TVA {0} invalide.
nl: Ongeldige {0} BTW-controlesom.

# InvalidIbanLength
source: Invalid length. Expected {0}, got {1}.
de: Ungültige Länge. Erwartet {0}, erhalten {1}.
fr: Longueur invalide. Attendu {0}, reçu {1}.
nl: Ongeldige lengte. Verwacht {0}, ontvangen {1}.

# InvalidIbanCountryCode
source: Invalid country code. Expected {0}.
de: Ungültiger Ländercode. Erwartet {0}.
fr: Code pays invalide. Attendu {0}.
nl: Ongeldige landcode. Verwacht {0}.

# InvalidIbanFormatDigits
source: {0} IBAN must contain only digits after the country code.
de: {0} IBAN darf nach dem Ländercode nur Ziffern enthalten.
fr: L'IBAN {0} ne doit contenir que des chiffres après le code pays.
nl: {0} IBAN mag na de landcode alleen cijfers bevatten.

# InvalidIbanFormatAlphanumeric
source: {0} IBAN must contain only alphanumeric characters after the country code.
de: {0} IBAN darf nach dem Ländercode nur alphanumerische Zeichen enthalten.
fr: L'IBAN {0} ne doit contenir que des caractères alphanumériques après le code pays.
nl: {0} IBAN mag na de landcode alleen alphanumerieke tekens bevatten.

# InvalidCardNumberLuhn
source: Invalid card number (Luhn check failed).
de: Ungültige Kartennummer (Luhn-Prüfung fehlgeschlagen).
fr: Numéro de carte Invalide (échec du contrôle Luhn).
nl: Ongeldig kaartnummer (Luhn-controle mislukt).

# InvalidCardNumberFormat
source: Card number contains invalid characters.
de: Kartennummer enthält ungültige Zeichen.
fr: Le numéro de carte contient des caractères invalides.
nl: Kaartnummer bevat ongeldige tekens.

# InvalidCvvDigits
source: CVV must contain only digits.
de: CVV darf nur Ziffern enthalten.
fr: Le CVV ne doit contenir que des chiffres.
nl: CVV mag alleen cijfers bevatten.

# InvalidCvvLength
source: Invalid CVV length for {0}.
de: Ungültige CVV-Länge für {0}.
fr: Longueur CVV Invalide pour {0}.
nl: Ongeldige CVV-lengte voor {0}.

# CardExpired
source: Card has expired.
de: Karte ist abgelaufen.
fr: La carte a expiré.
nl: Kaart is verlopen.

# CardYearTooFar
source: Expiration year is too far in the future.
de: Ablaufjahr liegt zu weit in der Zukunft.
fr: L'année d'expiration est trop loin dans le futur.
nl: Vervaldatum ligt te ver in de toekomst.

source: Invalid month.
de: Ungültiger Monat.
fr: Mois invalide.
nl: Ongeldige maand.

# InvalidRoutingNumberLength
source: Routing number must be 9 digits.
de: Routing-Nummer muss 9 Ziffern lang sein.
fr: Le numéro de routage doit comporter 9 chiffres.
nl: Routingnummer moet 9 cijfers bevatten.

# InvalidRoutingNumberFormat
source: Routing number must contain only digits.
de: Routing-Nummer darf nur Ziffern enthalten.
fr: Le numéro de routage ne doit contenir que des chiffres.
nl: Routingnummer mag alleen cijfers bevatten.

source: Invalid routing number checksum.
de: Ungültige Routing-Nummer-Prüfsumme.
fr: Somme de contrôle du numéro de routage invalide.
nl: Ongeldige routingnummer-controlesom.

# InvalidCpfLength
source: CPF must be 11 digits.
de: CPF muss 11 Ziffern lang sein.
fr: Le CPF doit comporter 11 chiffres.
nl: CPF moet 11 cijfers bevatten.

# InvalidCpfFormat
source: CPF must contain only digits.
de: CPF darf nur Ziffern enthalten.
fr: Le CPF ne doit contenir que des chiffres.
nl: CPF mag alleen cijfers bevatten.

# InvalidCpfIdenticalDigits
source: CPF cannot consist of all identical digits.
de: CPF darf nicht aus identischen Ziffern bestehen.
fr: Le CPF ne peut pas être composé de chiffres identiques.
nl: CPF mag niet uit identieke cijfers bestaan.

# InvalidCpfChecksum1
source: Invalid CPF checksum (1st digit).
de: Ungültige CPF-Prüfsumme (1. Ziffer).
fr: Somme de contrôle CPF Invalide (1er chiffre).
nl: Ongeldige CPF-controlesom (1e cijfer).

# InvalidCpfChecksum2
source: Invalid CPF checksum (2nd digit).
de: Ungültige CPF-Prüfsumme (2. Ziffer).
fr: Somme de contrôle CPF Invalide (2ème chiffre).
nl: Ongeldige CPF-controlesom (2e cijfer).

# InvalidCnpjLength
source: CNPJ must be 14 digits.
de: CNPJ muss 14 Ziffern lang sein.
fr: Le CNPJ doit comporter 14 chiffres.
nl: CNPJ moet 14 cijfers bevatten.

# InvalidCnpjFormat
source: CNPJ must contain only digits.
de: CNPJ darf nur Ziffern enthalten.
fr: Le CNPJ ne doit contenir que des chiffres.
nl: CNPJ mag alleen cijfers bevatten.

# InvalidCnpjIdenticalDigits
source: CNPJ cannot consist of all identical digits.
de: CNPJ darf nicht aus identischen Ziffern bestehen.
fr: Le CNPJ ne peut pas être composé de chiffres identiques.
nl: CNPJ mag niet uit identieke cijfers bestaan.

# InvalidCnpjChecksum1
source: Invalid CNPJ checksum (1st digit).
de: Ungültige CNPJ-Prüfsumme (1. Ziffer).
fr: Somme de contrôle CNPJ Invalide (1er chiffre).
nl: Ongeldige CNPJ-controlesom (1e cijfer).

# InvalidCnpjChecksum2
source: Invalid CNPJ checksum (2nd digit).
de: Ungültige CNPJ-Prüfsumme (2. Ziffer).
fr: Somme de contrôle CNPJ Invalide (2ème chiffre).
nl: Ongeldige CNPJ-controlesom (2e cijfer).

# InvalidCurpLength
source: CURP must be 18 characters.
de: CURP muss 18 Zeichen lang sein.
fr: Le CURP doit comporter 18 caractères.
nl: CURP moet 18 tekens bevatten.

source: Invalid CURP format.
de: Ungültiges CURP-Format.
fr: Format CURP invalide.
nl: Ongeldig CURP-formaat.

source: Invalid CURP checksum.
de: Ungültige CURP-Prüfsumme.
fr: Somme de contrôle CURP invalide.
nl: Ongeldige CURP-controlesom.

# InvalidUsccLength
source: USCC must be 18 characters.
de: USCC muss 18 Zeichen lang sein.
fr: L'USCC doit comporter 18 caractères.
nl: USCC moet 18 tekens bevatten.

# InvalidUsccCharacter
source: Invalid character '{0}' in USCC.
de: Ungültiges Zeichen '{0}' im USCC.
fr: Caractère Invalide '{0}' dans l'USCC.
nl: Ongeldig teken '{0}' in USCC.

source: Invalid USCC checksum.
de: Ungültige USCC-Prüfsumme.
fr: Somme de contrôle USCC invalide.
nl: Ongeldige USCC-controlesom.

# UnsupportedFormat
source: Unsupported format: {0}.
de: Nicht unterstütztes Format: {0}.
fr: Format non pris en charge : {0}.
nl: Niet-ondersteund formaat: {0}.

# InvalidRfcLength
source: RFC must be 12 (Company) or 13 (Person) characters.
de: RFC muss 12 (Unternehmen) oder 13 (Person) Zeichen lang sein.
fr: Le RFC doit comporter 12 (Entreprise) ou 13 (Personne) caractères.
nl: RFC moet 12 (Bedrijf) of 13 (Persoon) tekens bevatten.

source: Invalid RFC format.
de: Ungültiges RFC-Format.
fr: Format RFC invalide.
nl: Ongeldig RFC-formaat.

# InvalidNricLength
source: NRIC/FIN must be 9 characters.
de: NRIC/FIN muss 9 Zeichen lang sein.
fr: Le NRIC/FIN doit comporter 9 caractères.
nl: NRIC/FIN moet 9 tekens bevatten.

# InvalidNricPrefix
source: Invalid NRIC/FIN prefix.
de: Ungültiges NRIC/FIN-Präfix.
fr: Préfixe NRIC/FIN invalide.
nl: Ongeldige NRIC/FIN-prefix.

# InvalidNricDigits
source: NRIC/FIN must contain 7 digits.
de: NRIC/FIN muss 7 Ziffern enthalten.
fr: Le NRIC/FIN doit contenir 7 chiffres.
nl: NRIC/FIN moet 7 cijfers bevatten.

# InvalidNricChecksum
source: Invalid NRIC/FIN checksum.
de: Ungültige NRIC/FIN-Prüfsumme.
fr: Somme de contrôle NRIC/FIN invalide.
nl: Ongeldige NRIC/FIN-controlesom.

# InvalidCanadaRoutingNumberFormat
source: Invalid Canadian Routing Number format. Must be 9 digits starting with 0.
de: Ungültiges kanadisches Routing-Nummer-Format. Muss 9 Ziffern lang sein und mit 0 beginnen.
fr: Format de numéro de routage canadien invalide. Doit comporter 9 chiffres commençant par 0.
nl: Ongeldig Canadees routingnummer-formaat. Moet 9 cijfers bevatten en beginnen met 0.

# InvalidBsbFormat
source: Invalid BSB format. Must be 6 digits.
de: Ungültiges BSB-Format. Muss 6 Ziffern lang sein.
fr: Format BSB invalide. Doit comporter 6 chiffres.
nl: Ongeldig BSB-formaat. Moet 6 cijfers bevatten.

# InvalidIfscFormat
source: Invalid IFSC format. Must be 11 characters: 4 letters, 0, 6 alphanumeric.
de: Ungültiges IFSC-Format. Muss 11 Zeichen lang sein: 4 Buchstaben, 0, 6 alphanumerische Zeichen.
fr: Format IFSC invalide. Doit comporter 11 caractères : 4 lettres, 0, 6 alphanumériques.
nl: Ongeldig IFSC-formaat. Moet 11 tekens bevatten: 4 letters, 0, 6 alfanumeriek.

source: Invalid Poland NIP format.
de: Ungültiges Polen NIP-Format.
fr: Format NIP polonais invalide.
nl: Ongeldig Polen NIP-formaat.

# InvalidPolandNipChecksumForbidden
source: Invalid Poland NIP checksum (forbidden remainder).
de: Ungültige Polen NIP-Prüfsumme (verbotener Rest).
fr: Somme de contrôle NIP polonais Invalide (reste interdit).
nl: Ongeldige Polen NIP-controlesom (verboden rest).

source: Invalid Poland NIP checksum.
de: Ungültige Polen NIP-Prüfsumme.
fr: Somme de contrôle NIP polonais invalide.
nl: Ongeldige Polen NIP-controlesom.

source: Invalid Ukraine EDRPOU format.
de: Ungültiges Ukraine EDRPOU-Format.
fr: Format EDRPOU ukrainien invalide.
nl: Ongeldig Oekraïne EDRPOU-formaat.

source: Invalid Ukraine EDRPOU checksum.
de: Ungültige Ukraine EDRPOU-Prüfsumme.
fr: Somme de contrôle EDRPOU ukrainien invalide.
nl: Ongeldige Oekraïne EDRPOU-controlesom.

source: Invalid Turkey VKN format.
de: Ungültiges Türkei VKN-Format.
fr: Format VKN turc invalide.
nl: Ongeldig Turkije VKN-formaat.

source: Invalid Turkey VKN checksum.
de: Ungültige Türkei VKN-Prüfsumme.
fr: Somme de contrôle VKN turc invalide.
nl: Ongeldige Turkije VKN-controlesom.

source: Invalid Sweden VAT format.
de: Ungültiges Schweden USt-Format.
fr: Format de TVA suédois invalide.
nl: Ongeldig Zweden BTW-formaat.

source: Invalid Sweden VAT checksum.
de: Ungültige Schweden USt-Prüfsumme.
fr: Somme de contrôle de TVA suédois invalide.
nl: Ongeldige Zweden BTW-controlesom.

source: Invalid North Macedonia VAT format.
de: Ungültiges Nordmazedonien USt-Format.
fr: Format de TVA macédonien invalide.
nl: Ongeldig Noord-Macedonië BTW-formaat.

# InvalidNorthMacedoniaVatChecksumForbidden
source: Invalid North Macedonia VAT checksum (Check digit 10).
de: Ungültige Nordmazedonien USt-Prüfsumme (Prüfziffer 10).
fr: Somme de contrôle de TVA macédonien Invalide (chiffre de contrôle 10).
nl: Ongeldige Noord-Macedonië BTW-controlesom (Controlecijfer 10).

source: Invalid North Macedonia VAT checksum.
de: Ungültige Nordmazedonien USt-Prüfsumme.
fr: Somme de contrôle de TVA macédonien invalide.
nl: Ongeldige Noord-Macedonië BTW-controlesom.

# InvalidSwitzerlandQrReferenceLength
source: Swiss QR reference must be 27 digits.
de: Schweizer QR-Referenz muss 27 Ziffern lang sein.
fr: La référence QR suisse doit comporter 27 chiffres.
nl: Zwitserse QR-referentie moet 27 cijfers bevatten.

# InvalidBelgiumEnterpriseLength
source: Enterprise number must be 10 digits (or 9 digits for old format).
de: Unternehmensnummer muss 10 Ziffern (oder 9 Ziffern für altes Format) lang sein.
fr: Le numéro d'entreprise doit comporter 10 chiffres (ou 9 pour l'ancien format).
nl: Ondernemingsnummer moet 10 cijfers (of 9 cijfers voor oud formaat) bevatten.

# InvalidBelgiumEnterpriseStart
source: Enterprise number must start with 0 or 1.
de: Unternehmensnummer muss mit 0 oder 1 beginnen.
fr: Le numéro d'entreprise doit commencer par 0 ou 1.
nl: Ondernemingsnummer moet beginnen met 0 of 1.

# InvalidBelgiumEnterpriseCheckDigitsNumeric
source: Check digits must be numeric.
de: Prüfziffern müssen numerisch sein.
fr: Les chiffres de contrôle doivent être numériques.
nl: Controlecijfers moeten numeriek zijn.

# InvalidAzerbaijanVoenFormatSameDigits
source: VOEN cannot consist of all same digits.
de: VOEN darf nicht aus identischen Ziffern bestehen.
fr: Le VOEN ne peut pas être composé de chiffres identiques.
nl: VOEN mag niet uit identieke cijfers bestaan.

# InvalidMonacoRciFormat
source: Invalid RCI format.
de: Ungültiges RCI-Format.
fr: Format RCI invalide.
nl: Ongeldig RCI-formaat.

# InvalidMonacoIbanBankBranchDigits
source: Monaco Bank/Branch must be digits.
de: Monaco Bank/Filiale muss aus Ziffern bestehen.
fr: Le code banque/guichet Monaco doit être numérique.
nl: Monaco Bank/Filiaal moet uit cijfers bestaan.

# InvalidMonacoIbanRibKeyDigits
source: Monaco RIB Key must be digits.
de: Monaco RIB-Schlüssel muss aus Ziffern bestehen.
fr: La clé RIB Monaco doit être numérique.
nl: Monaco RIB-sleutel moet uit cijfers bestaan.

# InvalidMonacoIbanRibKey
source: Invalid RIB Key.
de: Ungültiger RIB-Schlüssel.
fr: Clé RIB invalide.
nl: Ongeldige RIB-sleutel.

source: Invalid Serbia PIB format.
de: Ungültiges Serbien PIB-Format.
fr: Format PIB serbe invalide.
nl: Ongeldig Servië PIB-formaat.

source: Invalid Serbia PIB checksum.
de: Ungültige Serbien PIB-Prüfsumme.
fr: Somme de contrôle PIB serbe invalide.
nl: Ongeldige Servië PIB-controlesom.

source: Invalid Serbia VAT format.
de: Ungültiges Serbien USt-Format.
fr: Format de TVA serbe invalide.
nl: Ongeldig Servië BTW-formaat.

source: Invalid Serbia VAT checksum.
de: Ungültige Serbien USt-Prüfsumme.
fr: Somme de contrôle de TVA serbe invalide.
nl: Ongeldige Servië BTW-controlesom.

source: Invalid San Marino VAT format.
de: Ungültiges San Marino USt-Format.
fr: Format de TVA Saint-Marin invalide.
nl: Ongeldig San Marino BTW-formaat.

source: Invalid San Marino COE format.
de: Ungültiges San Marino COE-Format.
fr: Format COE Saint-Marin invalide.
nl: Ongeldig San Marino COE-formaat.

source: Invalid Cyprus VAT format.
de: Ungültiges Zypern USt-Format.
fr: Format de TVA chypriote invalide.
nl: Ongeldig Cyprus BTW-formaat.

# InvalidCyprusVatChecksum
source: Invalid Cyprus checksum.
de: Ungültige Zypern Prüfsumme.
fr: Somme de contrôle chypriote invalide.
nl: Ongeldige Cyprus controlesom.

source: Invalid Romania VAT format.
de: Ungültiges Rumänien USt-Format.
fr: Format de TVA roumain invalide.
nl: Ongeldig Roemenië BTW-formaat.

source: Invalid Romania VAT checksum.
de: Ungültige Rumänien USt-Prüfsumme.
fr: Somme de contrôle de TVA roumain invalide.
nl: Ongeldige Roemenië BTW-controlesom.

source: Invalid Romania CIF format.
de: Ungültiges Rumänien CIF-Format.
fr: Format CIF roumain invalide.
nl: Ongeldig Roemenië CIF-formaat.

source: Invalid Romania CIF checksum.
de: Ungültige Rumänien CIF-Prüfsumme.
fr: Somme de contrôle CIF roumain invalide.
nl: Ongeldige Roemenië CIF-controlesom.

source: Invalid Norway VAT format.
de: Ungültiges Norwegen USt-Format.
fr: Format de TVA norvégien invalide.
nl: Ongeldig Noorwegen BTW-formaat.

# InvalidNorwayVatChecksumForbidden
source: Invalid Norway VAT checksum (Check digit 10).
de: Ungültige Norwegen USt-Prüfsumme (Prüfziffer 10).
fr: Somme de contrôle de TVA norvégien Invalide (chiffre de contrôle 10).
nl: Ongeldige Noorwegen BTW-controlesom (Controlecijfer 10).

source: Invalid Norway VAT checksum.
de: Ungültige Norwegen USt-Prüfsumme.
fr: Somme de contrôle de TVA norvégien invalide.
nl: Ongeldige Noorwegen BTW-controlesom.

# InvalidNorwayKidReference
source: Invalid Norwegian KID reference.
de: Ungültige norwegische KID-Referenz.
fr: Référence KID norvégienne invalide.
nl: Ongeldige Noorse KID-referentie.

source: Invalid Norway Org Number format.
de: Ungültiges Norwegen Org-Nummer-Format.
fr: Format de numéro d'organisation norvégien invalide.
nl: Ongeldig Noorwegen Org-nummer-formaat.

# InvalidNorwayOrgNumberChecksumForbidden
source: Invalid Norway Org Number checksum (forbidden remainder).
de: Ungültige Norwegen Org-Nummer-Prüfsumme (verbotener Rest).
fr: Somme de contrôle de numéro d'organisation norvégien Invalide (reste interdit).
nl: Ongeldige Noorwegen Org-nummer-controlesom (verboden rest).

source: Invalid Norway Org Number checksum.
de: Ungültige Norwegen Org-Nummer-Prüfsumme.
fr: Somme de contrôle de numéro d'organisation norvégien invalide.
nl: Ongeldige Noorwegen Org-nummer-controlesom.

# InvalidNorwayKidLength
source: Norwegian KID reference must be between 3 and 25 digits.
de: Norwegische KID-Referenz muss zwischen 3 und 25 Ziffern lang sein.
fr: La référence KID norvégienne doit comporter entre 3 et 25 chiffres.
nl: Noorse KID-referentie moet tussen 3 en 25 cijfers lang zijn.

# InvalidSingaporeUenLength
source: UEN must be 9 or 10 characters.
de: UEN muss 9 oder 10 Zeichen lang sein.
fr: L'UEN doit comporter 9 ou 10 caractères.
nl: UEN moet 9 of 10 tekens bevatten.

# InvalidSingaporeUenFormat
source: Invalid UEN format.
de: Ungültiges UEN-Format.
fr: Format UEN invalide.
nl: Ongeldig UEN-formaat.

# InvalidJapanCorporateNumberLength
source: Corporate Number must be 13 digits.
de: Unternehmensnummer muss 13 Ziffern lang sein.
fr: Le numéro d'entreprise doit comporter 13 chiffres.
nl: Ondernemingsnummer moet 13 cijfers bevatten.

# InvalidJapanCorporateNumberFormat
source: Corporate Number must contain only digits.
de: Unternehmensnummer darf nur Ziffern enthalten.
fr: Le numéro d'entreprise ne doit contenir que des chiffres.
nl: Ondernemingsnummer mag alleen cijfers bevatten.

# InvalidJapanCorporateNumberChecksum
source: Invalid Corporate Number checksum.
de: Ungültige Unternehmensnummer-Prüfsumme.
fr: Somme de contrôle du numéro d'entreprise invalide.
nl: Ongeldige ondernemingsnummer-controlesom.

# InvalidJapanMyNumberLength
source: My Number must be 12 digits.
de: My Number muss 12 Ziffern lang sein.
fr: Le My Number doit comporter 12 chiffres.
nl: My Number moet 12 cijfers bevatten.

# InvalidJapanMyNumberFormat
source: My Number must contain only digits.
de: My Number darf nur Ziffern enthalten.
fr: Le My Number ne doit contenir que des chiffres.
nl: My Number mag alleen cijfers bevatten.

# InvalidJapanMyNumberChecksum
source: Invalid My Number checksum.
de: Ungültige My Number-Prüfsumme.
fr: Somme de contrôle My Number invalide.
nl: Ongeldige My Number-controlesom.

# InvalidIndiaPanLength
source: PAN must be 10 characters.
de: PAN muss 10 Zeichen lang sein.
fr: Le PAN doit comporter 10 caractères.
nl: PAN moet 10 tekens bevatten.

# InvalidIndiaPanFormat
source: Invalid PAN format.
de: Ungültiges PAN-Format.
fr: Format PAN invalide.
nl: Ongeldig PAN-formaat.

# InvalidIndiaPanStatus
source: Invalid PAN status character (4th character).
de: Ungültiges PAN-Statuszeichen (4. Zeichen).
fr: Caractère de statut PAN Invalide (4ème caractère).
nl: Ongeldig PAN-status teken (4e teken).

# InvalidIndiaAadhaarLength
source: Aadhaar must be 12 digits.
de: Aadhaar muss 12 Ziffern lang sein.
fr: L'Aadhaar doit comporter 12 chiffres.
nl: Aadhaar moet 12 cijfers bevatten.

# InvalidIndiaAadhaarFormat
source: Aadhaar must contain only digits.
de: Aadhaar darf nur Ziffern enthalten.
fr: L'Aadhaar ne doit contenir que des chiffres.
nl: Aadhaar mag alleen cijfers bevatten.

# InvalidIndiaAadhaarChecksum
source: Invalid Aadhaar checksum.
de: Ungültige Aadhaar-Prüfsumme.
fr: Somme de contrôle Aadhaar invalide.
nl: Ongeldige Aadhaar-controlesom.

source: Invalid Iceland VAT format.
de: Ungültiges Island USt-Format.
fr: Format de TVA islandais invalide.
nl: Ongeldig IJsland BTW-formaat.

# InvalidCheckDigitsMod10Mod11
source: Invalid check digits (neither Mod10 nor Mod11 matched).
de: Ungültige Prüfziffern (weder Mod10 noch Mod11 passten).
fr: Chiffres de contrôle invalides (ni Mod10 ni Mod11 ne correspondent).
nl: Ongeldige controlecijfers (noch Mod10 noch Mod11 kwam overeen).

source: Invalid Slovakia VAT format.
de: Ungültiges Slowakei USt-Format.
fr: Format de TVA slovaque invalide.
nl: Ongeldig Slowakije BTW-formaat.

source: Invalid Slovakia VAT format (non-numeric).
de: Ungültiges Slowakei USt-Format (nicht numerisch).
fr: Format de TVA slovaque Invalide (non numérique).
nl: Ongeldig Slowakije BTW-formaat (niet-numeriek).

source: Invalid Slovakia VAT checksum.
de: Ungültige Slowakei USt-Prüfsumme.
fr: Somme de contrôle de TVA slovaque invalide.
nl: Ongeldige Slowakije BTW-controlesom.

# InvalidNorthMacedoniaCountryCode
source: Invalid country code. Expected MK.
de: Ungültiger Ländercode. Erwartet MK.
fr: Code pays invalide. Attendu MK.
nl: Ongeldige landcode. Verwacht MK.

source: Bank code must be numeric.
de: Bankleitzahl muss numerisch sein.
fr: Le code banque doit être numérique.
nl: Bankcode moet numeriek zijn.

source: Account number must be alphanumeric.
de: Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte doit être alphanumérique.
nl: Kontonummer moet alfanumeriek zijn.

source: National check digits must be numeric.
de: Nationale Prüfziffern müssen numerisch sein.
fr: Les chiffres de contrôle nationaux doivent être numériques.
nl: Nationale controlecijfers moeten numeriek zijn.

# InvalidMontenegroCountryCode
source: Invalid country code. Expected ME.
de: Ungültiger Ländercode. Erwartet ME.
fr: Code pays invalide. Attendu ME.
nl: Ongeldige landcode. Verwacht ME.

source: Account number must be numeric.
de: Kontonummer muss numerisch sein.
fr: Le numéro de compte doit être numérique.
nl: Kontonummer moet numeriek zijn.

source: Invalid Montenegro VAT format.
de: Ungültiges Montenegro USt-Format.
fr: Format de TVA monténégrin invalide.
nl: Ongeldig Montenegro BTW-formaat.

source: Invalid Montenegro VAT checksum (Remainder 10).
de: Ungültige Montenegro USt-Prüfsumme (Rest 10).
fr: Montenegro VAT somme de contrôle (Remainder 10).
nl: Ongeldige Montenegro BTW-controlesom (Rest 10).

source: Invalid Montenegro VAT checksum.
de: Ungültige Montenegro USt-Prüfsumme.
fr: Montenegro VAT somme de contrôle.
nl: Ongeldige Montenegro BTW-controlesom.

source: Invalid Bulgaria VAT format.
de: Ungültiges Bulgarien USt-Format.
fr: Format de TVA bulgare invalide.
nl: Ongeldig Bulgarije BTW-formaat.

source: Invalid Bulgaria VAT checksum.
de: Ungültige Bulgarien USt-Prüfsumme.
fr: Bulgaria VAT somme de contrôle.
nl: Ongeldige Bulgarije BTW-controlesom.

source: Invalid Lithuania VAT format.
de: Ungültiges Litauen USt-Format.
fr: Format de TVA lituanien invalide.
nl: Ongeldig Litouwen BTW-formaat.

source: Invalid Lithuania VAT checksum.
de: Ungültige Litauen USt-Prüfsumme.
fr: Lithuania VAT somme de contrôle.
nl: Ongeldige Litouwen BTW-controlesom.
