Repository: fdivrusa/Finova
Catalog: src/Finova.Core/Resources/ValidationMessages.*.resx
Languages: de, fr, nl

# InvalidIsoReferenceLength
source: Reference length must be between 5 and 25 characters.
de: Referenzlänge muss zwischen 5 und 25 Zeichen liegen.
fr: La longueur de la référence doit être comprise entre 5 et 25 caractères.
nl: Referentielengte moet tussen 5 en 25 tekens liggen.

# InvalidIsoReferencePrefix
source: Reference must start with 'RF'.
de: Referenz muss mit 'RF' beginnen.
fr: La référence doit commencer par 'RF'.
nl: Referentie moet beginnen met 'RF'.

# InvalidIsoReferenceCharacters
source: Reference contains invalid characters.
de: Referenz enthält ungültige Zeichen.
fr: La référence contient des caractères invalides.
nl: Referentie bevat ongeldige tekens.

# UnsupportedPaymentReferenceFormat
source: Format {0} is not supported by IsoPaymentReferenceValidator.
de: Format {0} wird vom IsoPaymentReferenceValidator nicht unterstützt.
fr: Le format {0} n'est pas pris en charge par IsoPaymentReferenceValidator.
nl: Formaat {0} wordt niet ondersteund door IsoPaymentReferenceValidator.

# InvalidLeiLength
source: LEI must be exactly 20 characters.
de: LEI muss genau 20 Zeichen lang sein.
fr: Le LEI doit comporter exactement 20 caractères.
nl: LEI moet precies 20 tekens lang zijn.

# InvalidLeiFormat
source: LEI must contain only alphanumeric characters.
de: LEI darf nur alphanumerische Zeichen enthalten.
fr: Le LEI ne doit contenir que des caractères alphanumériques.
nl: LEI mag alleen alfanumerieke tekens bevatten.

# LeiParsingFailed
source: Failed to parse LEI for checksum calculation.
de: Fehler beim Parsen der LEI für die Prüfsummenberechnung.
fr: Échec de l'analyse du LEI pour le calcul de la somme de contrôle.
nl: Parsen van LEI voor controlesom-berekening mislukt.

source: Invalid LEI checksum.
de: Ungültige LEI-Prüfsumme.
fr: Somme de contrôle LEI invalide.
nl: Ongeldige LEI-controlesom.

# InvalidBicLength
source: BIC must be 8 or 11 characters long.
de: BIC muss 8 oder 11 Zeichen lang sein.
fr: Le BIC doit comporter 8 ou 11 caractères.
nl: BIC moet 8 of 11 tekens lang zijn.

# InvalidBicBankCode
source: Bank code must contain only letters.
de: Bankleitzahl darf nur Buchstaben enthalten.
fr: Le code banque ne doit contenir que des lettres.
nl: Bankcode mag alleen letters bevatten.

# InvalidBicCountryCode
source: Country code must contain only letters.
de: Ländercode darf nur Buchstaben enthalten.
fr: Le code pays ne doit contenir que des lettres.
nl: Landcode mag alleen letters bevatten.

# InvalidBicLocationCode
source: Location code must be alphanumeric.
de: Ortscode muss alphanumerisch sein.
fr: Le code de localisation doit être alphanumérique.
nl: Locatiecode moet alfanumeriek zijn.

# InvalidBicBranchCode
source: Branch code must be alphanumeric.
de: Filialcode muss alphanumerisch sein.
fr: Le code guichet doit être alphanumérique.
nl: Filiaalcode moet alfanumeriek zijn.

source: Invalid IBAN.
de: Ungültige IBAN.
fr: IBAN invalide.
nl: Ongeldige IBAN.

source: Invalid Brazil Bank Code format.
de: Ungültiges Brasilien Bankleitzahl-Format.
fr: Format de code banque brésilien invalide.
nl: Ongeldig Brazilië bankcode-formaat.

source: Invalid ABN length.
de: Ungültige ABN-Länge.
fr: Longueur ABN invalide.
nl: Ongeldige ABN-lengte.

source: Invalid ABN format.
de: Ungültiges ABN-Format.
fr: Format ABN invalide.
nl: Ongeldig ABN-formaat.

source: Invalid ABN checksum.
de: Ungültige ABN-Prüfsumme.
fr: Somme de contrôle ABN invalide.
nl: Ongeldige ABN-controlesom.

source: Invalid SIN length.
de: Ungültige SIN-Länge.
fr: Longueur SIN invalide.
nl: Ongeldige SIN-lengte.

source: Invalid SIN format.
de: Ungültiges SIN-Format.
fr: Format SIN invalide.
nl: Ongeldig SIN-formaat.

source: Invalid SIN checksum.
de: Ungültige SIN-Prüfsumme.
fr: Somme de contrôle SIN invalide.
nl: Ongeldige SIN-controlesom.

# HungaryIbanMustBeDigits
source: Hungary IBAN must contain only digits after the country code.
de: Ungarische IBAN muss aus Ziffern bestehen.
fr: L'IBAN hongrois ne doit contenir que des chiffres après le code pays.
nl: Hongaars IBAN moet uit cijfers bestaan.

# IcelandIbanMustContainOnlyDigits
source: Iceland IBAN must contain only digits after the country code.
de: Isländische IBAN darf nur Ziffern enthalten.
fr: L'IBAN islandais ne doit contenir que des chiffres après le code pays.
nl: IJslands IBAN mag alleen cijfers bevatten.

source: Invalid Austria VAT format.
de: Ungültiges österreichisches USt-Format.
fr: Format de TVA autrichien invalide.
nl: Ongeldig Oostenrijks BTW-formaat.

source: Invalid Belgium OGM/VCS reference.
de: Ungültige belgische OGM/VCS-Referenz.
fr: Référence OGM/VCS belge invalide.
nl: Ongeldige Belgische OGM/VCS-referentie.

source: Invalid Belgium VAT format.
de: Ungültiges belgisches USt-Format.
fr: Format de TVA belge invalide.
nl: Ongeldig Belgisch BTW-formaat.

source: Invalid Bosnia and Herzegovina VAT checksum.
de: Ungültige bosnische USt-Prüfsumme.
fr: Somme de contrôle de TVA de Bosnie-Herzégovine invalide.
nl: Ongeldige Bosnische BTW-controlesom.

# InvalidBosniaAndHerzegovinaVatChecksumRemainderOne
source: Invalid Bosnia and Herzegovina VAT checksum (remainder 1).
de: Ungültige bosnische USt-Prüfsumme (Rest 1).
fr: Somme de contrôle de TVA de Bosnie-Herzégovine invalide (reste 1).
nl: Ongeldige Bosnische BTW-controlesom (rest 1).

source: Invalid Bosnia and Herzegovina VAT format.
de: Ungültiges bosnisches USt-Format.
fr: Format de TVA de Bosnie-Herzégovine invalide.
nl: Ongeldig Bosnisch BTW-formaat.

source: Invalid CIN.
de: Ungültige CIN.
fr: CIN invalide.
nl: Ongeldige CIN.

# InvalidCnpjRepeated
source: Invalid CNPJ (repeated digits).
de: Ungültige wiederholte CNPJ-Ziffern.
fr: CNPJ invalide (chiffres répétés).
nl: Ongeldige herhaalde CNPJ-cijfers.

# InvalidCpfRepeated
source: Invalid CPF (repeated digits).
de: Ungültige wiederholte CPF-Ziffern.
fr: CPF invalide (chiffres répétés).
nl: Ongeldige herhaalde CPF-cijfers.

source: Invalid Estonia BBAN structure.
de: Ungültige estnische BBAN-Struktur.
fr: Structure BBAN estonienne invalide.
nl: Ongeldige Estse BBAN-structuur.

source: Invalid Estonia Registrikood checksum.
de: Ungültige estnische Registrikood-Prüfsumme.
fr: Somme de contrôle Registrikood estonien invalide.
nl: Ongeldige Estse Registrikood-controlesom.

source: Invalid Estonia Registrikood format.
de: Ungültiges estnisches Registrikood-Format.
fr: Format Registrikood estonien invalide.
nl: Ongeldig Ests Registrikood-formaat.

source: Invalid Estonia VAT checksum.
de: Ungültige estnische USt-Prüfsumme.
fr: Somme de contrôle de TVA estonien invalide.
nl: Ongeldige Estse BTW-controlesom.

source: Invalid Estonia VAT format.
de: Ungültiges estnisches USt-Format.
fr: Format de TVA estonien invalide.
nl: Ongeldig Ests BTW-formaat.

# InvalidHungaryAdoszamLength
source: Invalid Hungary Adószám length.
de: Ungültige ungarische Adószám-Länge.
fr: Longueur Adószám hongrois invalide.
nl: Ongeldige Hongaarse Adószám-lengte.

source: Invalid Hungary VAT checksum.
de: Ungültige ungarische USt-Prüfsumme.
fr: Somme de contrôle de TVA hongrois invalide.
nl: Ongeldige Hongaarse BTW-controlesom.

source: Invalid Hungary VAT format.
de: Ungültiges ungarisches USt-Format.
fr: Format de TVA hongrois invalide.
nl: Ongeldig Hongaars BTW-formaat.

# InvalidIcelandCountryCode
source: Invalid country code. Expected IS.
de: Ungültiger isländischer Ländercode.
fr: Code pays invalide. Attendu IS.
nl: Ongeldige IJslandse landcode.

source: Invalid Iceland Kennitala.
de: Ungültige isländische Kennitala.
fr: Kennitala islandais invalide.
nl: Ongeldige IJslandse Kennitala.

# InvalidItalyCountryCode
source: Invalid country code. Expected IT.
de: Ungültiger italienischer Ländercode.
fr: Code pays invalide. Attendu IT.
nl: Ongeldige Italiaanse landcode.

source: Invalid Italy IUV check digit.
de: Ungültige italienische IUV-Prüfziffer.
fr: Chiffre de contrôle IUV italien invalide.
nl: Ongeldig Italiaans IUV-controlecijfer.

source: Invalid Italy IUV length.
de: Ungültige italienische IUV-Länge.
fr: Longueur IUV italien invalide.
nl: Ongeldige Italiaanse IUV-lengte.

source: Invalid Italy IUV reference.
de: Ungültige italienische IUV-Referenz.
fr: Référence IUV italienne invalide.
nl: Ongeldige Italiaanse IUV-referentie.

source: Invalid Kennitala checksum.
de: Ungültige Kennitala-Prüfsumme.
fr: Somme de contrôle Kennitala invalide.
nl: Ongeldige Kennitala-controlesom.

source: Invalid Kennitala date.
de: Ungültiges Kennitala-Datum.
fr: Date Kennitala invalide.
nl: Ongeldige Kennitala-datum.

source: Invalid Kennitala format.
de: Ungültiges Kennitala-Format.
fr: Format Kennitala invalide.
nl: Ongeldig Kennitala-formaat.

source: Invalid Kosovo fiscal number length.
de: Ungültige Länge der kosovarischen Steuernummer.
fr: Longueur du numéro fiscal du Kosovo invalide.
nl: Ongeldige lengte fiscaal nummer Kosovo.

# InvalidLatviaCountryCode
source: Invalid country code. Expected LV.
de: Ungültiger lettischer Ländercode.
fr: Code pays invalide. Attendu LV.
nl: Ongeldige Letse landcode.

source: Invalid Latvia PVN length.
de: Ungültige lettische PVN-Länge.
fr: Longueur PVN letton invalide.
nl: Ongeldige Letse PVN-lengte.

source: Invalid Latvia VAT checksum.
de: Ungültige lettische USt-Prüfsumme.
fr: Somme de contrôle de TVA letton invalide.
nl: Ongeldige Letse BTW-controlesom.

# InvalidLatviaVatChecksumResultMinusOne
source: Invalid Latvia VAT checksum (result -1).
de: Ungültige lettische USt-Prüfsumme (Ergebnis -1).
fr: Somme de contrôle de TVA letton invalide (résultat -1).
nl: Ongeldige Letse BTW-controlesom (resultaat -1).

source: Invalid Latvia VAT format.
de: Ungültiges lettisches USt-Format.
fr: Format de TVA letton invalide.
nl: Ongeldig Lets BTW-formaat.

# InvalidLiechtensteinCountryCode
source: Invalid country code. Expected LI.
de: Ungültiger liechtensteinischer Ländercode.
fr: Code pays invalide. Attendu LI.
nl: Ongeldige Liechtensteinse landcode.

source: Invalid Liechtenstein PEID checksum (check digit 10).
de: Ungültige liechtensteinische PEID-Prüfsumme (Ziffer 10).
fr: Somme de contrôle PEID du Liechtenstein invalide (chiffre de contrôle 10).
nl: Ongeldige Liechtensteinse PEID-controlesom (cijfer 10).

source: Invalid Liechtenstein PEID length.
de: Ungültige liechtensteinische PEID-Länge.
fr: Longueur PEID du Liechtenstein invalide.
nl: Ongeldige Liechtensteinse PEID-lengte.

# ItalyAbiCabMustBeDigits
source: Italy ABI/CAB must contain only digits.
de: Italienische ABI/CAB müssen Ziffern sein.
fr: ABI/CAB italien doit être composé uniquement de chiffres.
nl: Italiaanse ABI/CAB moeten cijfers zijn.

source: Italy account number must be alphanumeric.
de: Italienische Kontonummer muss alphanumerisch sein.
fr: Le numéro de compte italien doit être alphanumérique.
nl: Italiaans rekeningnummer moet alfanumeriek zijn.

# ItalyCinMustBeLetter
source: Italy CIN must be a letter.
de: Italienische CIN muss ein Buchstabe sein.
fr: Le CIN italien doit être une lettre.
nl: Italiaanse CIN moet een letter zijn.

source: Kennitala cannot be empty.
de: Kennitala darf nicht leer sein.
fr: Kennitala ne peut pas être vide.
nl: Kennitala mag niet leeg zijn.

source: Latvia IBAN must be alphanumeric.
de: Lettische IBAN muss alphanumerisch sein.
fr: L'IBAN letton doit être alphanumérique.
nl: Lets IBAN moet alfanumeriek zijn.

source: Registrikood cannot be empty.
de: Registrikood darf nicht leer sein.
fr: Registrikood ne peut pas être vide.
nl: Registrikood mag niet leeg zijn.

# InvalidSwedishOcrLength
source: Swedish OCR reference must be between 2 and 25 digits.
de: Ungültige schwedische OCR-Länge.
fr: Longueur OCR suédoise invalide.
nl: Zweedse OCR-referentie moet tussen 2 en 25 cijfers zijn.

source: Invalid length digit.
de: Ungültige Längenziffer.
fr: Chiffre de longueur invalide.
nl: Ongeldig lengtecijfer.

# BelgiumIbanMustBeDigits
source: Belgium IBAN must contain only digits after the country code.
de: Belgische IBAN muss aus Ziffern bestehen.
fr: L'IBAN belge ne doit contenir que des chiffres après le code pays.
nl: Belgisch IBAN moet alleen cijfers bevatten na de landcode.

# BulgariaIbanInvalidAccount
source: Invalid Bulgaria IBAN account number.
de: Ungültiges bulgarisches IBAN-Konto.
fr: Le numéro de compte IBAN bulgare doit être alphanumérique.
nl: Ongeldig Bulgaars IBAN-rekeningnummer.

# BankAccountMustBeDigits
source: Bank account must contain only digits.
de: Kontonummer darf nur Ziffern enthalten.
fr: Le numéro de compte bancaire doit contenir uniquement des chiffres.
nl: Rekeningnummer mag alleen cijfers bevatten.

# BulgariaIbanInvalidBranchCode
source: Invalid Bulgaria IBAN branch code.
de: Ungültiger bulgarischer IBAN-Filialcode.
fr: Code agence IBAN bulgare invalide.
nl: Ongeldige Bulgaarse IBAN-filiaalcode.

# BulgariaIbanInvalidControlChar
source: Invalid Bulgaria IBAN control character.
de: Ungültiges bulgarisches IBAN-Kontrollzeichen.
fr: Caractère de contrôle IBAN bulgare invalide.
nl: Ongeldig Bulgaars IBAN-controleteken.

# BulgariaUicInvalidChecksum10
source: Invalid Bulgaria UIC checksum (10 digits).
de: Ungültige bulgarische UIC-Prüfsumme (10 Ziffern).
fr: Somme de contrôle UIC bulgare invalide (10 chiffres).
nl: Ongeldige Bulgaarse UIC-controlesom (10 cijfers).

# BulgariaUicInvalidChecksum11
source: Invalid Bulgaria UIC checksum (11 digits).
de: Ungültige bulgarische UIC-Prüfsumme (11 Ziffern).
fr: Somme de contrôle UIC bulgare invalide (11 chiffres).
nl: Ongeldige Bulgaarse UIC-controlesom (11 cijfers).

# BulgariaUicInvalidChecksum12
source: Invalid Bulgaria UIC checksum (12 digits).
de: Ungültige bulgarische UIC-Prüfsumme (12 Ziffern).
fr: Somme de contrôle UIC bulgare invalide (12 chiffres).
nl: Ongeldige Bulgaarse UIC-controlesom (12 cijfers).

# EstoniaIbanMustBeDigits
source: Estonia IBAN must contain only digits after the country code.
de: Estnische IBAN muss aus Ziffern bestehen.
fr: L'IBAN estonien ne doit contenir que des chiffres.
nl: Ests IBAN moet uit cijfers bestaan.

source: Invalid Bank Routing Number.
de: Ungültige Bankleitzahl.
fr: Numéro de routage bancaire invalide.
nl: Ongeldige bankleitzahl.

source: Invalid Belgium BBAN structure.
de: Ungültige belgische BBAN-Struktur.
fr: Structure BBAN belge invalide.
nl: Ongeldige Belgische BBAN-structuur.

# InvalidBnChecksum
source: Invalid Business Number checksum.
de: Ungültige Unternehmensnummer-Prüfsumme.
fr: Somme de contrôle BN invalide.
nl: Ongeldige ondernemingsnummer-controlesom.

# InvalidBnFormat
source: Invalid Business Number format.
de: Ungültiges Unternehmensnummer-Format.
fr: Le BN doit contenir uniquement des chiffres.
nl: Ongeldig ondernemingsnummer-formaat.

# InvalidBnLength
source: Invalid Business Number length.
de: Ungültige Unternehmensnummer-Länge.
fr: Le BN doit contenir 9 chiffres.
nl: Ongeldige ondernemingsnummer-lengte.

source: Invalid CIF check character.
de: Ungültiges CIF-Prüfzeichen.
fr: Caractère de contrôle CIF invalide.
nl: Ongeldig CIF-controleteken.

source: Invalid CIF check digit.
de: Ungültige CIF-Prüfziffer.
fr: Chiffre de contrôle CIF invalide.
nl: Ongeldig CIF-controlecijfer.

source: Invalid CIF check letter.
de: Ungültiger CIF-Prüfbuchstabe.
fr: Lettre de contrôle CIF invalide.
nl: Ongeldige CIF-controleletter.

source: Invalid CIF format.
de: Ungültiges CIF-Format.
fr: Format CIF invalide.
nl: Ongeldig CIF-formaat.

source: Invalid CNAPS format.
de: Ungültiges CNAPS-Format.
fr: Format CNAPS invalide.
nl: Ongeldig CNAPS-formaat.

source: Invalid Codice Fiscale check digit.
de: Ungültige Codice Fiscale-Prüfziffer.
fr: Chiffre de contrôle Codice Fiscale invalide.
nl: Ongeldig Codice Fiscale-controlecijfer.

source: Invalid Codice Fiscale format.
de: Ungültiges Codice Fiscale-Format.
fr: Format Codice Fiscale invalide.
nl: Ongeldig Codice Fiscale-formaat.

source: Invalid CRN format.
de: Ungültiges CRN-Format.
fr: Format CRN invalide.
nl: Ongeldig CRN-formaat.

source: Invalid CRN length.
de: Ungültige CRN-Länge.
fr: Le CRN doit contenir 8 caractères.
nl: Ongeldige CRN-lengte.

source: Invalid EIN format.
de: Ungültiges EIN-Format.
fr: Le EIN doit contenir uniquement des chiffres.
nl: Ongeldig EIN-formaat.

source: Invalid EIN length.
de: Ungültige EIN-Länge.
fr: Le EIN doit contenir 9 chiffres.
nl: Ongeldige EIN-lengte.

source: Invalid Finnish reference length.
de: Ungültige finnische Referenzlänge.
fr: La référence finlandaise doit contenir entre 4 et 20 chiffres.
nl: Ongeldige Finse referentielengte.

source: Invalid Italian identifier length.
de: Ungültige italienische Kennungslänge.
fr: Longueur d'identifiant italien invalide.
nl: Ongeldige Italiaanse identificatielengte.

source: Invalid Japan bank account length.
de: Ungültige japanische Kontonummer-Länge.
fr: Longueur de compte bancaire japonais invalide.
nl: Ongeldige Japanse rekeningnummer-lengte.

source: Invalid Luxembourg Bank Code.
de: Ungültige Luxemburg Bankleitzahl.
fr: Code bancaire luxembourgeois invalide.
nl: Ongeldige Luxemburg bankcode.

source: Invalid National ID.
de: Ungültige nationale ID.
fr: Identifiant national invalide.
nl: Ongeldige nationale ID.

source: Invalid NIB key.
de: Ungültiger NIB-Schlüssel.
fr: Clé NIB invalide.
nl: Ongeldige NIB-sleutel.

source: Invalid Norway BBAN checksum.
de: Ungültige Norwegen BBAN-Prüfsumme.
fr: Somme de contrôle BBAN norvégienne invalide.
nl: Ongeldige Noorwegen BBAN-controlesom.

source: Invalid Norway IBAN format.
de: Ungültiges Norwegen IBAN-Format.
fr: Format IBAN norvégien invalide.
nl: Ongeldig Noorwegen IBAN-formaat.

source: Invalid Partita IVA check digit.
de: Ungültige Partita IVA-Prüfziffer.
fr: Chiffre de contrôle Partita IVA invalide.
nl: Ongeldig Partita IVA-controlecijfer.

source: Invalid Partita IVA format.
de: Ungültiges Partita IVA-Format.
fr: Format Partita IVA invalide.
nl: Ongeldig Partita IVA-formaat.

# InvalidPvmLength
source: PVM must be 9 digits.
de: Ungültige PVM-Länge.
fr: Le PVM doit contenir 9 chiffres.
nl: PVM moet 9 cijfers zijn.

source: Invalid Romania IBAN format.
de: Ungültiges Rumänien IBAN-Format.
fr: Format IBAN roumain invalide.
nl: Ongeldig Roemenië IBAN-formaat.

source: Invalid San Marino ABI/CAB.
de: Ungültige San Marino ABI/CAB.
fr: ABI/CAB Saint-Marin invalide.
nl: Ongeldige San Marino ABI/CAB.

source: Invalid San Marino CIN.
de: Ungültige San Marino CIN.
fr: CIN Saint-Marin invalide.
nl: Ongeldige San Marino CIN.

source: Invalid Serbia IBAN format.
de: Ungültiges Serbien IBAN-Format.
fr: Format IBAN serbe invalide.
nl: Ongeldig Servië IBAN-formaat.

source: Invalid Singapore bank account length.
de: Ungültige Singapur Kontonummer-Länge.
fr: Longueur de compte bancaire singapourien invalide.
nl: Ongeldige Singapore rekeningnummer-lengte.

source: Invalid Slovak account number checksum.
de: Ungültige slowakische Kontonummer-Prüfsumme.
fr: Somme de contrôle du numéro de compte slovaque invalide.
nl: Ongeldige Slowaakse rekeningnummer-controlesom.

source: Invalid Slovak prefix checksum.
de: Ungültige slowakische Präfix-Prüfsumme.
fr: Somme de contrôle du préfixe slovaque invalide.
nl: Ongeldige Slowaakse prefix-controlesom.

source: Invalid Slovenian SI12 reference.
de: Ungültige slowenische SI12-Referenz.
fr: Référence SI12 slovène invalide.
nl: Ongeldige Sloveense SI12-referentie.

source: Invalid Slovenia reference length.
de: Ungültige Slowenien Referenzlänge.
fr: Longueur de référence slovène invalide.
nl: Ongeldige Slovenië referentielengte.

source: Invalid Slovenia reference prefix.
de: Ungültiges Slowenien Referenz-Präfix.
fr: Préfixe de référence slovène invalide.
nl: Ongeldige Slovenië referentie-prefix.

source: Invalid Slovenia VAT checksum.
de: Ungültige Slowenien USt-Prüfsumme.
fr: Somme de contrôle TVA slovène invalide.
nl: Ongeldige Slovenië BTW-controlesom.

source: Invalid Slovenia VAT checksum (forbidden).
de: Ungültige Slowenien USt-Prüfsumme (verboten).
fr: Somme de contrôle TVA slovène invalide (reste interdit).
nl: Ongeldige Slovenië BTW-controlesom (verboden).

source: Invalid Slovenia VAT format.
de: Ungültiges Slowenien USt-Format.
fr: Format TVA slovène invalide.
nl: Ongeldig Slovenië BTW-formaat.

source: Invalid Spanish DC check.
de: Ungültige spanische DC-Prüfung.
fr: Vérification DC espagnole invalide.
nl: Ongeldige Spaanse DC-controle.

source: Invalid Swedish OCR reference.
de: Ungültige schwedische OCR-Referenz.
fr: Référence OCR suédoise invalide.
nl: Ongeldige Zweedse OCR-referentie.

source: Invalid Swiss QR reference.
de: Ungültige Schweizer QR-Referenz.
fr: Référence QR suisse invalide.
nl: Ongeldige Zwitserse QR-referentie.

source: Invalid Switzerland Account Number format.
de: Ungültiges Schweiz Kontonummer-Format.
fr: Format de numéro de compte suisse invalide.
nl: Ongeldig Zwitserland rekeningnummer-formaat.

source: Invalid Switzerland Clearing Number format.
de: Ungültiges Schweiz Clearing-Nummer-Format.
fr: Format de numéro de clearing suisse invalide.
nl: Ongeldig Zwitserland clearingnummer-formaat.

source: Invalid Tax ID.
de: Ungültige Steuer-ID.
fr: Identifiant fiscal invalide.
nl: Ongeldige BTW-ID.

source: Invalid TFN checksum.
de: Ungültige TFN-Prüfsumme.
fr: Somme de contrôle TFN invalide.
nl: Ongeldige TFN-controlesom.

source: Invalid TFN format.
de: Ungültiges TFN-Format.
fr: Le TFN doit contenir uniquement des chiffres.
nl: Ongeldig TFN-formaat.

source: Invalid TFN length.
de: Ungültige TFN-Länge.
fr: Le TFN doit contenir 8 ou 9 chiffres.
nl: Ongeldige TFN-lengte.

source: Invalid Turkey Account Number.
de: Ungültige Türkei Kontonummer.
fr: Numéro de compte turc invalide.
nl: Ongeldig Turkije rekeningnummer.

source: Invalid Turkey Bank Code.
de: Ungültige Türkei Bankleitzahl.
fr: Code bancaire turc invalide.
nl: Ongeldige Turkije bankcode.

source: Invalid Turkey Reserve Char.
de: Ungültiges Türkei Reservezeichen.
fr: Caractère de réserve turc invalide.
nl: Ongeldig Turkije reserveteken.

source: Invalid UK Bank Code format.
de: Ungültiges UK Bankleitzahl-Format.
fr: Le code bancaire britannique doit être composé de lettres.
nl: Ongeldig UK bankcode-formaat.

source: Invalid Ukraine Account Number format.
de: Ungültiges Ukraine Kontonummer-Format.
fr: Le numéro de compte ukrainien doit être composé de chiffres.
nl: Ongeldig Oekraïne rekeningnummer-formaat.

source: Invalid Ukraine Bank Code format.
de: Ungültiges Ukraine Bankleitzahl-Format.
fr: Le code bancaire (MFO) ukrainien doit être composé de chiffres.
nl: Ongeldig Oekraïne bankcode-formaat.

source: Invalid UK Sort Code format.
de: Ungültiges UK Sort Code-Format.
fr: Le code de tri/numéro de compte britannique doit être composé de chiffres.
nl: Ongeldig UK Sort Code-formaat.

source: Invalid Vatican IBAN format.
de: Ungültiges Vatikan IBAN-Format.
fr: Format IBAN Vatican invalide.
nl: Ongeldig Vaticaan IBAN-formaat.

source: Invalid Vatican VAT checksum.
de: Ungültige Vatikan USt-Prüfsumme.
fr: Somme de contrôle TVA Vatican invalide.
nl: Ongeldige Vaticaan BTW-controlesom.

source: Invalid Vatican VAT format.
de: Ungültiges Vatikan USt-Format.
fr: Format TVA Vatican invalide.
nl: Ongeldig Vaticaan BTW-formaat.

source: Invalid V-tal length.
de: Ungültige V-tal-Länge.
fr: Longueur VTAL invalide.
nl: Ongeldige V-tal-lengte.

# NoBankRoutingValidatorRegistered
source: No Bank Routing validator registered for this country.
de: Kein Bankleitzahl-Validator für dieses Land registriert.
fr: Aucun validateur de numéro de routage bancaire enregistré.
nl: Geen bankleitzahl-validator geregistreerd voor dit land.

# NoNationalIdValidatorRegistered
source: No National ID validator registered for this country.
de: Kein National-ID-Validator für dieses Land registriert.
fr: Aucun validateur d'identifiant national enregistré.
nl: Geen nationaal ID-validator geregistreerd voor dit land.
